/*
#############################################################################################
# Rocket League (210513.57953.327225) SDK
# Generated with the UE3SDKGenerator v4.2.0
# ========================================================================================= #
# File: Core_parameters.h
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK, Crunchy
# Links: www.github.com/ItsBranK/UE3SDKGenerator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once
#include "../SdkConstants.hpp"

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Function Parameters
# ========================================================================================= #
*/

// Function Core.Object.RSmoothInterpTo
// [0x00020003] 
struct UObject_execRSmoothInterpTo_Parms
{
	struct FRotator                                    From;                                             		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    To;                                               		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              Lambda;                                           		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      		// 0x0020 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.VSmoothInterpTo
// [0x00020003] 
struct UObject_execVSmoothInterpTo_Parms
{
	struct FVector                                     From;                                             		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     To;                                               		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              Lambda;                                           		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x0020 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FSmoothInterpTo
// [0x00020003] 
struct UObject_execFSmoothInterpTo_Parms
{
	float                                              From;                                             		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              To;                                               		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Lambda;                                           		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSmoothInterpLerpValue
// [0x00020003] 
struct UObject_execGetSmoothInterpLerpValue_Parms
{
	float                                              Lambda;                                           		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetTypedOuter
// [0x00020401] 
struct UObject_execGetTypedOuter_Parms
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.MarkPendingKill
// [0x00020401] 
struct UObject_execMarkPendingKill_Parms
{
};

// Function Core.Object.NotNone
// [0x00022003] 
struct UObject_execNotNone_Parms
{
	class UObject*                                     O;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SwapArrayItems
// [0x80022001] 
struct UObject_execSwapArrayItems_Parms
{
};

// Function Core.Object.Swap
// [0x80022001] 
struct UObject_execSwap_Parms
{
};

// Function Core.Object.SumFloat
// [0x00022003] 
struct UObject_execSumFloat_Parms
{
	float                                              Total;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SumInt
// [0x00022003] 
struct UObject_execSumInt_Parms
{
	int                                                Total;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                Value;                                            		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortDescendingFloat
// [0x00022003] 
struct UObject_execSortDescendingFloat_Parms
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortAscendingFloat
// [0x00022003] 
struct UObject_execSortAscendingFloat_Parms
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortDescendingString
// [0x00022003] 
struct UObject_execSortDescendingString_Parms
{
	struct FString                                     A;                                                		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     B;                                                		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int                                                ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortAscendingString
// [0x00022003] 
struct UObject_execSortAscendingString_Parms
{
	struct FString                                     A;                                                		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     B;                                                		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int                                                ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortDescendingQWORD
// [0x00022003] 
struct UObject_execSortDescendingQWORD_Parms
{
	unsigned long long                                 A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	unsigned long long                                 B;                                                		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortAscendingQWORD
// [0x00022003] 
struct UObject_execSortAscendingQWORD_Parms
{
	unsigned long long                                 A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	unsigned long long                                 B;                                                		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortDescendingInt
// [0x00022003] 
struct UObject_execSortDescendingInt_Parms
{
	int                                                A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SortAscendingInt
// [0x00022003] 
struct UObject_execSortAscendingInt_Parms
{
	int                                                A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PadString
// [0x00022003] 
struct UObject_execPadString_Parms
{
	struct FString                                     Str;                                              		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	int                                                Characters;                                       		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FString                                     ReturnValue;                                      		// 0x0018 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// int                                             PadIdx;                                           		// 0x0028 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetFrameCounter
// [0x00022401] 
struct UObject_execGetFrameCounter_Parms
{
	unsigned long long                                 ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetScaledAxisValue
// [0x00022401] 
struct UObject_execGetScaledAxisValue_Parms
{
	float                                              Value;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Sensitivity;                                      		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              MaxSensitivity;                                   		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSingleton
// [0x00022401] 
struct UObject_execGetSingleton_Parms
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.GetObjectProvider
// [0x00022401] 
struct UObject_execGetObjectProviderW_Parms
{
	class UObjectProvider*                             ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function Core.Object.IsAutomationTest
// [0x00022401] 
struct UObject_execIsAutomationTest_Parms
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEdition
// [0x00022401] 
struct UObject_execGetEdition_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsEdition
// [0x00022401] 
struct UObject_execIsEdition_Parms
{
	unsigned char                                      Edition;                                          		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ToJson
// [0x00020401] 
struct UObject_execToJson_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.SetRooted
// [0x00020401] 
struct UObject_execSetRooted_Parms
{
	bool                                               bRooted : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Core.Object.ProfNodeEvent
// [0x00022401] 
struct UObject_execProfNodeEvent_Parms
{
	struct FString                                     EventName;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function Core.Object.ProfNodeSetDepthThreshold
// [0x00022401] 
struct UObject_execProfNodeSetDepthThreshold_Parms
{
	int                                                Depth;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.ProfNodeSetTimeThresholdSeconds
// [0x00022401] 
struct UObject_execProfNodeSetTimeThresholdSeconds_Parms
{
	float                                              Threshold;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.ProfNodeStop
// [0x00026401] 
struct UObject_execProfNodeStop_Parms
{
	int                                                AssumedTimerIndex;                                		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.ProfNodeStart
// [0x00022401] 
struct UObject_execProfNodeStart_Parms
{
	struct FString                                     TimerName;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.CreateGuidString
// [0x00822003] 
struct UObject_execCreateGuidString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// struct FGuid                                    NewGuid;                                          		// 0x0010 (0x0010) [0x0000000000000000]               
};

// Function Core.Object.GetStringFromGuid
// [0x00422401] 
struct UObject_execGetStringFromGuid_Parms
{
	struct FGuid                                       InGuid;                                           		// 0x0000 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FString                                     ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetGuidFromString
// [0x00422401] 
struct UObject_execGetGuidFromString_Parms
{
	struct FString                                     InGuidString;                                     		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FGuid                                       ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.CreateGuid
// [0x00022401] 
struct UObject_execCreateGuid_Parms
{
	struct FGuid                                       ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsGuidValid
// [0x00422401] 
struct UObject_execIsGuidValid_Parms
{
	struct FGuid                                       InGuid;                                           		// 0x0000 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.InvalidateGuid
// [0x00422401] 
struct UObject_execInvalidateGuid_Parms
{
	struct FGuid                                       InGuid;                                           		// 0x0000 (0x0010) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.FindStructProperty
// [0x00020401] 
struct UObject_execFindStructProperty_Parms
{
	class UClass*                                      PropertyClass;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       PropertyName;                                     		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       StructName;                                       		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.FindProperty
// [0x00020401] 
struct UObject_execFindProperty_Parms
{
	class UClass*                                      PropertyClass;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       PropertyName;                                     		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.DuplicateObject
// [0x00024401] 
struct UObject_execDuplicateObject_Parms
{
	class UObject*                                     Template;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ObjOuter;                                         		// 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UClass*                                      DestClass;                                        		// 0x0010 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.RunningAverage
// [0x00020401] 
struct UObject_execRunningAverage_Parms
{
	float                                              OldAverage;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              NewValue;                                         		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                NewCount;                                         		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetCurrentTime
// [0x00022401] 
struct UObject_execGetCurrentTimeW_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetMaxLinearColorBrightness
// [0x00020501] 
struct UObject_execGetMaxLinearColorBrightness_Parms
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetMaxColorBrightness
// [0x00020103] 
struct UObject_execGetMaxColorBrightness_Parms
{
	struct FColor                                      C;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.LABtoRGB
// [0x00022401] 
struct UObject_execLABtoRGB_Parms
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RGBtoLAB
// [0x00022401] 
struct UObject_execRGBtoLAB_Parms
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.HSVtoRGB
// [0x00022401] 
struct UObject_execHSVtoRGB_Parms
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RGBtoHSV
// [0x00022401] 
struct UObject_execRGBtoHSV_Parms
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IntToLinearColor
// [0x00022103] 
struct UObject_execIntToLinearColor_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IntToColor
// [0x00022401] 
struct UObject_execIntToColor_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.LinearColorToInt
// [0x00022103] 
struct UObject_execLinearColorToInt_Parms
{
	struct FLinearColor                                C;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ColorToInt
// [0x00022401] 
struct UObject_execColorToInt_Parms
{
	struct FColor                                      C;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SolveVelocityQuadratic
// [0x00420401] 
struct UObject_execSolveVelocityQuadratic_Parms
{
	float                                              Distance;                                         		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Speed;                                            		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Accel;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Time;                                             		// 0x000C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Sign
// [0x00020401] 
struct UObject_execSign_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeVector2D
// [0x00822003] 
struct UObject_execMakeVector2D_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector2D                                V;                                                		// 0x0010 (0x0008) [0x0000000000000000]               
};

// Function Core.Object.VAbs
// [0x00022003] 
struct UObject_execVAbs_Parms
{
	struct FVector                                     V;                                                		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeVector
// [0x00822003] 
struct UObject_execMakeVector_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Z;                                                		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  V;                                                		// 0x0018 (0x000C) [0x0000000000000000]               
};

// Function Core.Object.FlattenVector
// [0x00020103] 
struct UObject_execFlattenVector_Parms
{
	struct FVector                                     NormalToFlatten;                                  		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     PlaneNormal;                                      		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x0018 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetRealArchetypeName
// [0x00020401] 
struct UObject_execGetRealArchetypeName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FormatTime
// [0x00022003] 
struct UObject_execFormatTime_Parms
{
	int                                                Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FString                                     ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// int                                             Mins;                                             		// 0x0018 (0x0004) [0x0000000000000000]               
	// struct FString                                  NewTimeString;                                    		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function Core.Object.GetTextArchetype
// [0x00022401] 
struct UObject_execGetTextArchetype_Parms
{
	class UClass*                                      ArchetypeClass;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FString                                     Path;                                             		// 0x0008 (0x0010) [0x0000000000400082] (CPF_Const | CPF_Parm | CPF_NeedCtorLink)
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.IsArchetype
// [0x00020401] 
struct UObject_execIsArchetype_Parms
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.UnsubscribeFromAllEvents
// [0x00020401] 
struct UObject_execUnsubscribeFromAllEvents_Parms
{
};

// Function Core.Object.NewInstance
// [0x00024401] 
struct UObject_execNewInstance_Parms
{
	class UObject*                                     ObjOuter;                                         		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FName                                       ObjName;                                          		// 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.PrintDebugInfo
// [0x00020100] 
struct UObject_execPrintDebugInfo_Parms
{
	class UDebugDrawer*                                Drawer;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.RotatorFromInt
// [0x00820003] 
struct UObject_execRotatorFromInt_Parms
{
	int                                                RotationPitchAndYaw;                              		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FRotator                                 Rotation;                                         		// 0x0010 (0x000C) [0x0000000000000000]               
};

// Function Core.Object.RotatorToInt
// [0x00020003] 
struct UObject_execRotatorToInt_Parms
{
	struct FRotator                                    Rotation;                                         		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetLanguage
// [0x00022401] 
struct UObject_execGetLanguage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetRandomOptionSumFrequency
// [0x00420003] 
struct UObject_execGetRandomOptionSumFrequency_Parms
{
	TArray<float>                                      FreqList;                                         		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                           FreqSum;                                          		// 0x0014 (0x0004) [0x0000000000000000]               
	// float                                           RandVal;                                          		// 0x0018 (0x0004) [0x0000000000000000]               
	// int                                             Idx;                                              		// 0x001C (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetBuildChangelistNumber
// [0x00020401] 
struct UObject_execGetBuildChangelistNumber_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEngineVersion
// [0x00020401] 
struct UObject_execGetEngineVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetAppSeconds
// [0x00020401] 
struct UObject_execGetAppSeconds_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSystemTime
// [0x00420401] 
struct UObject_execGetSystemTime_Parms
{
	int                                                Year;                                             		// 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int                                                Month;                                            		// 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int                                                DayOfWeek;                                        		// 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int                                                Day;                                              		// 0x000C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int                                                Hour;                                             		// 0x0010 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int                                                Min;                                              		// 0x0014 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int                                                Sec;                                              		// 0x0018 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int                                                MSec;                                             		// 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.TimeStamp
// [0x00020401] 
struct UObject_execTimeStamp_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.TransformVectorByRotation
// [0x00024401] 
struct UObject_execTransformVectorByRotation_Parms
{
	struct FRotator                                    SourceRotation;                                   		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SourceVector;                                     		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               bInverse : 1;                                     		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPackageName
// [0x00020003] 
struct UObject_execGetPackageName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UObject*                                  O;                                                		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function Core.Object.IsPendingKill
// [0x00020401] 
struct UObject_execIsPendingKill_Parms
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RangeByteToFloatUnsigned
// [0x00020501] 
struct UObject_execRangeByteToFloatUnsigned_Parms
{
	unsigned char                                      inputByte;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RangeByteToFloatSigned
// [0x00020501] 
struct UObject_execRangeByteToFloatSigned_Parms
{
	unsigned char                                      inputByte;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FloatToRangeByteUnsigned
// [0x00020501] 
struct UObject_execFloatToRangeByteUnsigned_Parms
{
	float                                              inputFloat;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FloatToRangeByteSigned
// [0x00020501] 
struct UObject_execFloatToRangeByteSigned_Parms
{
	float                                              inputFloat;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.UnwindHeading
// [0x00022103] 
struct UObject_execUnwindHeading_Parms
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FindDeltaAngle
// [0x00022103] 
struct UObject_execFindDeltaAngle_Parms
{
	float                                              A1;                                               		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              A2;                                               		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                           delta;                                            		// 0x000C (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetHeadingAngle
// [0x00022103] 
struct UObject_execGetHeadingAngle_Parms
{
	struct FVector                                     Dir;                                              		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                           Angle;                                            		// 0x0010 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetAngularDegreesFromRadians
// [0x00422103] 
struct UObject_execGetAngularDegreesFromRadians_Parms
{
	struct FVector2D                                   OutFOV;                                           		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.GetAngularFromDotDist
// [0x00422401] 
struct UObject_execGetAngularFromDotDist_Parms
{
	struct FVector2D                                   OutAngDist;                                       		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   DotDist;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.GetAngularDistance
// [0x00422401] 
struct UObject_execGetAngularDistance_Parms
{
	struct FVector2D                                   OutAngularDist;                                   		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            		// 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            		// 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            		// 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetDotDistance
// [0x00422401] 
struct UObject_execGetDotDistance_Parms
{
	struct FVector2D                                   OutDotDist;                                       		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            		// 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            		// 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            		// 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.LinePlaneIntersection
// [0x00C24003] 
struct UObject_execLinePlaneIntersection_Parms
{
	struct FVector                                     LineStart;                                        		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     LineEnd;                                          		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     PlaneOrigin;                                      		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     PlaneNormal;                                      		// 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Out_Intersection;                                 		// 0x0030 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              Out_T;                                            		// 0x003C (0x0004) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	bool                                               bCheckLineSegment : 1;                            		// 0x0040 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  		// 0x0044 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  RayDir;                                           		// 0x0048 (0x000C) [0x0000000000000000]               
};

// Function Core.Object.PointProjectToPlane
// [0x00022401] 
struct UObject_execPointProjectToPlane_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     C;                                                		// 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x0030 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToPlane
// [0x00C24103] 
struct UObject_execPointDistToPlane_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    Orientation;                                      		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     out_ClosestPoint;                                 		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  AxisX;                                            		// 0x0034 (0x000C) [0x0000000000000000]               
	// struct FVector                                  AxisY;                                            		// 0x0040 (0x000C) [0x0000000000000000]               
	// struct FVector                                  AxisZ;                                            		// 0x004C (0x000C) [0x0000000000000000]               
	// struct FVector                                  PointNoZ;                                         		// 0x0058 (0x000C) [0x0000000000000000]               
	// struct FVector                                  OriginNoZ;                                        		// 0x0064 (0x000C) [0x0000000000000000]               
	// float                                           fPointZ;                                          		// 0x0070 (0x0004) [0x0000000000000000]               
	// float                                           fProjDistToAxis;                                  		// 0x0074 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.PointDistToSegment
// [0x00424401] 
struct UObject_execPointDistToSegment_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     StartPoint;                                       		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     EndPoint;                                         		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToLine
// [0x00424401] 
struct UObject_execPointDistToLine_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Line;                                             		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPerObjectConfigObjects
// [0x00426405] 
struct UObject_execGetPerObjectConfigObjects_Parms
{
	class UClass*                                      SearchClass;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     OutObject;                                        		// 0x0008 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UObject*                                     ObjectOuter;                                      		// 0x0010 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int                                                MaxResults;                                       		// 0x0018 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.GetPerObjectConfigSections
// [0x00426401] 
struct UObject_execGetPerObjectConfigSections_Parms
{
	class UClass*                                      SearchClass;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	TArray<struct FString>                             out_SectionNames;                                 		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UObject*                                     ObjectOuter;                                      		// 0x0018 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int                                                MaxResults;                                       		// 0x0020 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ImportJSON
// [0x00422401] 
struct UObject_execImportJSON_Parms
{
	struct FString                                     PropertyName;                                     		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     JSON;                                             		// 0x0010 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function Core.Object.StaticSaveConfig
// [0x00022401] 
struct UObject_execStaticSaveConfig_Parms
{
};

// Function Core.Object.SaveConfig
// [0x00020401] 
struct UObject_execSaveConfig_Parms
{
};

// Function Core.Object.LoadSeekFreeObject
// [0x00022401] 
struct UObject_execLoadSeekFreeObject_Parms
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FString                                     Path;                                             		// 0x0008 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function Core.Object.FindObject
// [0x00022401] 
struct UObject_execFindObject_Parms
{
	struct FString                                     ObjectName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ObjectClass;                                      		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DynamicLoadObject
// [0x00026401] 
struct UObject_execDynamicLoadObject_Parms
{
	struct FString                                     ObjectName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ObjectClass;                                      		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               MayFail : 1;                                      		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      		// 0x0020 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EnumFromString
// [0x00022401] 
struct UObject_execEnumFromString_Parms
{
	class UObject*                                     E;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       ValueName;                                        		// 0x0008 (0x0008) [0x0000000000000880] (CPF_Parm | CPF_CoerceParm)
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEnum
// [0x00022401] 
struct UObject_execGetEnum_Parms
{
