/*
#############################################################################################
# Rocket League (210617.48985.332260) SDK
# Generated with the UE3SDKGenerator v4.2.0
# ========================================================================================= #
# File: ProjectX_parameters.h
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK, Crunchy
# Links: www.github.com/ItsBranK/UE3SDKGenerator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Function Parameters
# ========================================================================================= #
*/

// Function ProjectX._SharedHelpers.ScoreDeltaFromDefault
// [0x00022401] 
struct U_SharedHelpers_execScoreDeltaFromDefault_Parms
{
	class UObject*                                     Object;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX._SharedHelpers.DrawShadowedText
// [0x00826003] 
struct U_SharedHelpers_execDrawShadowedText_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FString                                     Text;                                             		// 0x0008 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	int                                                ShadowOffsetX;                                    		// 0x0018 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int                                                ShadowOffsetY;                                    		// 0x001C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int                                                ShadowAlpha;                                      		// 0x0020 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	// float                                           X;                                                		// 0x0024 (0x0004) [0x0000000000000000]               
	// float                                           Y;                                                		// 0x0028 (0x0004) [0x0000000000000000]               
	// struct FColor                                   C;                                                		// 0x002C (0x0004) [0x0000000000000000]               
};

// Function ProjectX._SharedHelpers.IsInTransientPackage
// [0x00022401] 
struct U_SharedHelpers_execIsInTransientPackage_Parms
{
	class UObject*                                     Obj;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX._SharedHelpers.GetAPlayerController
// [0x00026401] 
struct U_SharedHelpers_execGetAPlayerController_Parms
{
	class UClass*                                      PlayerControllerClass;                            		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class APlayerController*                           ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function ProjectX._SharedHelpers.GetDefaultObject
// [0x00022401] 
struct U_SharedHelpers_execGetDefaultObject_Parms
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function ProjectX._SharedHelpers.DumpUnreferencedAnims
// [0x00022401] 
struct U_SharedHelpers_execDumpUnreferencedAnims_Parms
{
};

// Function ProjectX._SharedHelpers.GetLanguageExtension
// [0x00022401] 
struct U_SharedHelpers_execGetLanguageExtension_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.JoinCredentialsFromString
// [0x00422003] 
struct U_Types_X_execJoinCredentialsFromString_Parms
{
	struct FString                                     Credentials;                                      		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     JoinName;                                         		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FString                                     JoinPassword;                                     		// 0x0020 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	// TArray<struct FString>                          Result;                                           		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.JoinCredentialsToString
// [0x00022003] 
struct U_Types_X_execJoinCredentialsToString_Parms
{
	struct FString                                     JoinName;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     JoinPassword;                                     		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.GenerateRandomPrivateMatchPassword
// [0x00022003] 
struct U_Types_X_execGenerateRandomPrivateMatchPassword_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.GenerateRandomPrivateMatchName
// [0x00022003] 
struct U_Types_X_execGenerateRandomPrivateMatchName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.GenerateRandomName
// [0x00022003] 
struct U_Types_X_execGenerateRandomName_Parms
{
	int                                                Length;                                           		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FString                                     ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// struct FString                                  Chars;                                            		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// int                                             CharsLength;                                      		// 0x0028 (0x0004) [0x0000000000000000]               
	// struct FString                                  Result;                                           		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.OnTimer
// [0x00140001] 
struct U_Types_X_execOnTimer_Parms
{
};

// Function ProjectX._Types_X.GetServerReservationData
// [0x00C22003] 
struct U_Types_X_execGetServerReservationData_Parms
{
	struct FCheckReservationResponse                   Response;                                         		// 0x0000 (0x0080) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FServerReservationData                      ReturnValue;                                      		// 0x0080 (0x0080) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// struct FServerReservationData                   Data;                                             		// 0x0100 (0x0080) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.ServiceExecutionDelegate
// [0x00120001] 
struct U_Types_X_execServiceExecutionDelegate_Parms
{
	class UPsyNetClientService_X*                      Service;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX._Types_X.OnPriviledgeChecked
// [0x00120001] 
struct U_Types_X_execOnPriviledgeChecked_Parms
{
	class UPrivilegeCheck_X*                           PrivilegeCheck;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ActorComponent_X.Reattach
// [0x00020401] 
struct UActorComponent_X_execReattach_Parms
{
};

// Function ProjectX.ActorComponent_X.Tick
// [0x00080800] 
struct UActorComponent_X_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ActorComponent_X.Detached
// [0x00080800] 
struct UActorComponent_X_eventDetached_Parms
{
};

// Function ProjectX.ActorComponent_X.Attached
// [0x00080800] 
struct UActorComponent_X_eventAttached_Parms
{
};

// Function ProjectX.ActorComponent_X.BeginPlay
// [0x00080800] 
struct UActorComponent_X_eventBeginPlay_Parms
{
};

// Function ProjectX.ExplosionComponent_X.ProcessHit
// [0x00824802] 
struct UExplosionComponent_X_eventProcessHit_Parms
{
	class AActor*                                      Victim;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               ExtraHitInfo;                                     		// 0x0018 (0x0028) [0x0000000000000080] (CPF_Parm)    
	float                                              DamageScale;                                      		// 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	// struct FVector                                  MomentumDir;                                      		// 0x0044 (0x000C) [0x0000000000000000]               
};

// Function ProjectX.ExplosionComponent_X.Detached
// [0x00080802] 
struct UExplosionComponent_X_eventDetached_Parms
{
};

// Function ProjectX.ExplosionHitHandler_X.Destroy
// [0x00020002] 
struct UExplosionHitHandler_X_execDestroy_Parms
{
};

// Function ProjectX.ExplosionHitHandler_X.Init
// [0x00020002] 
struct UExplosionHitHandler_X_execInit_Parms
{
	class UActorComponent_X*                           ExplosionGoal;                                    		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function ProjectX.ExplosionHitHandler_X.ProcessHit
// [0x00424800] 
struct UExplosionHitHandler_X_eventProcessHit_Parms
{
	class AActor*                                      Victim;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FContactInformation                         ContactInfo;                                      		// 0x0014 (0x001C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	float                                              DamageScale;                                      		// 0x0030 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function ProjectX.MICParamDispenserComponent_X.__MICParamDispenserComponent_X__Attached_C4543C3C4C3448911B36B1BD9F0327F7
// [0x40040003] 
struct UMICParamDispenserComponent_X_exec__MICParamDispenserComponent_X__Attached_C4543C3C4C3448911B36B1BD9F0327F7_Parms
{
	struct FFXAttachment                               A;                                                		// 0x0000 (0x0110) [0x0000000000480080] (CPF_Parm | CPF_Component | CPF_NeedCtorLink)
	bool                                               ReturnValue : 1;                                  		// 0x0110 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.MICParamDispenserComponent_X.Attached
// [0x00080802] 
struct UMICParamDispenserComponent_X_eventAttached_Parms
{
	// class AFXActor_X*                               FXActor;                                          		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.MICParamDispenserComponent_X.SetActorParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetActorParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Value;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.MICParamDispenserComponent_X.SetLinearColorParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetLinearColorParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                Value;                                            		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.MICParamDispenserComponent_X.SetVectorParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetVectorParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Value;                                            		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.MICParamDispenserComponent_X.SetFloatParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetFloatParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.MICParamDispenserComponent_X.SetNameParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetNameParameter_Parms
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       Value;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.GetColorParameter
// [0x00420401] 
struct UShakeComponent_X_execGetColorParameter_Parms
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
	struct FColor                                      OutColor;                                         		// 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ShakeComponent_X.GetVectorParameter
// [0x00420401] 
struct UShakeComponent_X_execGetVectorParameter_Parms
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
	struct FVector                                     OutVector;                                        		// 0x0008 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ShakeComponent_X.GetFloatParameter
// [0x00420401] 
struct UShakeComponent_X_execGetFloatParameter_Parms
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
	float                                              OutFloat;                                         		// 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ShakeComponent_X.SetColorParameter
// [0x00020401] 
struct UShakeComponent_X_execSetColorParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      Param;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.SetVectorRandParameter
// [0x00420401] 
struct UShakeComponent_X_execSetVectorRandParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Param;                                            		// 0x0008 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FVector                                     ParamLow;                                         		// 0x0014 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function ProjectX.ShakeComponent_X.SetVectorParameter
// [0x00020401] 
struct UShakeComponent_X_execSetVectorParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Param;                                            		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.SetFloatRandParameter
// [0x00020401] 
struct UShakeComponent_X_execSetFloatRandParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Param;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ParamLow;                                         		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.SetFloatParameter
// [0x00020401] 
struct UShakeComponent_X_execSetFloatParameter_Parms
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Param;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.IsPlaying
// [0x00020003] 
struct UShakeComponent_X_execIsPlaying_Parms
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ShakeComponent_X.StopShake
// [0x00024803] 
struct UShakeComponent_X_eventStopShake_Parms
{
	float                                              InBlendOutTime;                                   		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function ProjectX.ShakeComponent_X.InitParams
// [0x00080401] 
struct UShakeComponent_X_execInitParams_Parms
{
};

// Function ProjectX.ShakeComponent_X.PlayShake
// [0x00020803] 
struct UShakeComponent_X_eventPlayShake_Parms
{
};

// Function ProjectX.ShakeComponent_X.Detached
// [0x00080802] 
struct UShakeComponent_X_eventDetached_Parms
{
};

// Function ProjectX.ShakeComponent_X.Attached
// [0x00080802] 
struct UShakeComponent_X_eventAttached_Parms
{
};

// Function ProjectX.AdHocBeacon_X.GetNodeCountMax
// [0x00020401] 
struct UAdHocBeacon_X_execGetNodeCountMax_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.AdHocBeacon_X.AdHocJoinMatch
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocJoinMatch_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreateMatch
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocCreateMatch_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocIsActive
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocIsActive_Parms
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.AdHocBeacon_X.AdHocDisconnectFromAccessPoint
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocDisconnectFromAccessPoint_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocConnectToAccessPoint
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocConnectToAccessPoint_Parms
{
	int                                                ScanResultIndex;                                  		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.AdHocBeacon_X.AdHocScanForAccessPoints
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocScanForAccessPoints_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocBecomeStation
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocBecomeStation_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocRejectStation
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocRejectStation_Parms
{
	int                                                NetworkNodeIndex;                                 		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.AdHocBeacon_X.AdHocBecomeAccessPoint
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocBecomeAccessPoint_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocSetAdvertiseData
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocSetAdvertiseData_Parms
{
	struct FString                                     AdvertiseData;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.AdHocBeacon_X.AdHocDestroy
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocDestroy_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreate
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocCreate_Parms
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreateWithUsername
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocCreateWithUsername_Parms
{
	struct FString                                     Username;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.AdHocBeacon_X.Construct
// [0x00020802] 
struct UAdHocBeacon_X_eventConstruct_Parms
{
};

// Function ProjectX.FXActor_X.DumpDebugInfo
// [0x00820803] 
struct AFXActor_X_eventDumpDebugInfo_Parms
{
	// class UFXActorEvent_X*                          FXState;                                          		// 0x0000 (0x0008) [0x0000000000000000]               
	// int                                             ForEachRefIndex_ADE4302349FA73FA73EF47BBB42884C2; 		// 0x0008 (0x0004) [0x0000000000000000]               
	// struct FFXAttachment                            Attachment;                                       		// 0x0010 (0x0110) [0x0000000000400000] (CPF_NeedCtorLink)
	// int                                             ForEachRefIndex_8D0069274FE306FCFB8838805296DFAD; 		// 0x0120 (0x0004) [0x0000000000000000]               
	// class UFXActorEvent_X*                          AttachAnyEvent;                                   		// 0x0128 (0x0008) [0x0000000000000000]               
	// int                                             ForEachRefIndex_F5498761406902480BF4C2BE10DD0A88; 		// 0x0130 (0x0004) [0x0000000000000000]               
	// class UFXActorEvent_X*                          DetachAnyEvent;                                   		// 0x0138 (0x0008) [0x0000000000000000]               
	// int                                             ForEachRefIndex_F1E89123412DBCECDCEE1BA39BD46A88; 		// 0x0140 (0x0004) [0x0000000000000000]               
	// class UFXActorEvent_X*                          AttachAllEvent;                                   		// 0x0148 (0x0008) [0x0000000000000000]               
	// int                                             ForEachRefIndex_FC4B38724A31FE1AAE6F09839343B399; 		// 0x0150 (0x0004) [0x0000000000000000]               
	// class UFXAttachmentTraitBase_X*                 Trait;                                            		// 0x0158 (0x0008) [0x0000000000000000]               
	// int                                             ForEachRefIndex_C6B1C5E44AD098DCE70A058883B69CFD; 		// 0x0160 (0x0004) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.GetTrait
// [0x00020401] 
struct AFXActor_X_execGetTrait_Parms
{
	class UClass*                                      TraitClass;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int                                                AttachmentIdx;                                    		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UFXAttachmentTraitBase_X*                    ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function ProjectX.FXActor_X.OnAnimEnd
// [0x00020802] 
struct AFXActor_X_eventOnAnimEnd_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.OnAnimPlay
// [0x00020802] 
struct AFXActor_X_eventOnAnimPlay_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.Destroyed
// [0x00020802] 
struct AFXActor_X_eventDestroyed_Parms
{
};

// Function ProjectX.FXActor_X.SubscribeState
// [0x00024401] 
struct AFXActor_X_execSubscribeState_Parms
{
	class UFXActorEvent_X*                             FXEvent;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             OnPushed;                                         		// 0x0008 (0x0018) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
	struct FScriptDelegate                             OnPopped;                                         		// 0x0020 (0x0018) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.FXActor_X.SetStateEnabled
// [0x00020103] 
struct AFXActor_X_execSetStateEnabled_Parms
{
	class UFXActorEvent_X*                             State;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               bEnable : 1;                                      		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function ProjectX.FXActor_X.OnToggle
// [0x00020103] 
struct AFXActor_X_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.OnTriggerFXActor_X
// [0x00020103] 
struct AFXActor_X_execOnTriggerFXActor_X_Parms
{
	class USeqAct_TriggerFXActor_X*                    SeqAct;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AActor*                                   AttachTo;                                         		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.Inherit
// [0x00880102] 
struct AFXActor_X_execInherit_Parms
{
	class AFXActor_X*                                  Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// int                                             OtherIdx;                                         		// 0x0008 (0x0004) [0x0000000000000000]               
	// struct FFXAttachment                            NewAttachment;                                    		// 0x0010 (0x0110) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function ProjectX.FXActor_X.ResetParticles
// [0x00020103] 
struct AFXActor_X_execResetParticles_Parms
{
	// class UParticleSystemComponent*                 PSC;                                              		// 0x0000 (0x0008) [0x0000000004000000] (CPF_EditInline)
};

// Function ProjectX.FXActor_X.StopAllEffects
// [0x00080102] 
struct AFXActor_X_execStopAllEffects_Parms
{
};

// Function ProjectX.FXActor_X.DeactivateAndDestroy
// [0x00020903] 
struct AFXActor_X_eventDeactivateAndDestroy_Parms
{
};

// Function ProjectX.FXActor_X.OnDetached
// [0x00080903] 
struct AFXActor_X_eventOnDetached_Parms
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function ProjectX.FXActor_X.DeactivateFXComponent
// [0x00020903] 
struct AFXActor_X_eventDeactivateFXComponent_Parms
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	// class UAnimNodeSequence*                        AnimNodeSeq;                                      		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.ActivateFXComponent
// [0x00080903] 
struct AFXActor_X_eventActivateFXComponent_Parms
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function ProjectX.FXActor_X.OnAttached
// [0x00080903] 
struct AFXActor_X_eventOnAttached_Parms
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	// class USkeletalMeshComponent*                   AttachmentMesh;                                   		// 0x0008 (0x0008) [0x0000000004000000] (CPF_EditInline)
	// class UPrimitiveComponent*                      PrimComp;                                         		// 0x0010 (0x0008) [0x0000000004000000] (CPF_EditInline)
	// int                                             AttachmentIdx;                                    		// 0x0018 (0x0004) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.GetComponentsAttachmentIndex
// [0x00020103] 
struct AFXActor_X_execGetComponentsAttachmentIndex_Parms
{
	class UActorComponent*                             ComponentToFind;                                  		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.UpdateFXStates
// [0x00080501] 
struct AFXActor_X_execUpdateFXStates_Parms
{
};

// Function ProjectX.FXActor_X.IsLocallyControlled
// [0x00080501] 
struct AFXActor_X_execIsLocallyControlled_Parms
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.GetControllerOwner
// [0x00080501] 
struct AFXActor_X_execGetControllerOwner_Parms
{
	class AController*                                 ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.ToggleState
// [0x00020501] 
struct AFXActor_X_execToggleState_Parms
{
	class UFXActorEvent_X*                             NewState;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.RemoveStateForceUpdate
// [0x00020501] 
struct AFXActor_X_execRemoveStateForceUpdate_Parms
{
	class UFXActorEvent_X*                             OldState;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.RemoveEvent
// [0x00020501] 
struct AFXActor_X_execRemoveEvent_Parms
{
	class UFXActorEvent_X*                             OldEvent;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.RemoveState
// [0x00020501] 
struct AFXActor_X_execRemoveState_Parms
{
	class UFXActorEvent_X*                             OldState;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.AddEvent
// [0x00020501] 
struct AFXActor_X_execAddEvent_Parms
{
	class UFXActorEvent_X*                             NewEvent;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.AddState
// [0x00020501] 
struct AFXActor_X_execAddState_Parms
{
	class UFXActorEvent_X*                             NewState;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.CanRemoveEvent
// [0x00420501] 
struct AFXActor_X_execCanRemoveEvent_Parms
{
	struct FFXActorEventCheck                          InEvent;                                          		// 0x0000 (0x0010) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.IsStateActive
// [0x00020501] 
struct AFXActor_X_execIsStateActive_Parms
{
	class UFXActorEvent_X*                             InState;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.Deactivate
// [0x00020401] 
struct AFXActor_X_execDeactivate_Parms
{
};

// Function ProjectX.FXActor_X.Activate
// [0x00020401] 
struct AFXActor_X_execActivate_Parms
{
};

// Function ProjectX.FXActor_X.HandleParentStatePopped
// [0x00040103] 
struct AFXActor_X_execHandleParentStatePopped_Parms
{
	class AFXActor_X*                                  P;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UFXActorEvent_X*                             Event;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.HandleParentStatePushed
// [0x00040103] 
struct AFXActor_X_execHandleParentStatePushed_Parms
{
	class AFXActor_X*                                  P;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UFXActorEvent_X*                             Event;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.BindTo
// [0x00020103] 
struct AFXActor_X_execBindTo_Parms
{
	class AFXActor_X*                                  ParentFXActor;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class UFXActorEvent_X*                          ParentState;                                      		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.SetAttachmentActor
// [0x00020102] 
struct AFXActor_X_execSetAttachmentActor_Parms
{
	class AActor*                                      AttachToActor;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.PostBeginPlay
// [0x00020102] 
struct AFXActor_X_execPostBeginPlay_Parms
{
};

// Function ProjectX.FXActor_X.AllAttachments
// [0x00424505] 
struct AFXActor_X_execAllAttachments_Parms
{
	class UClass*                                      ComponentClass;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UActorComponent*                             OutComponent;                                     		// 0x0008 (0x0008) [0x0000000004000180] (CPF_Parm | CPF_OutParm | CPF_EditInline)
	int                                                OutAttachmentIdx;                                 		// 0x0010 (0x0004) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
};

// Function ProjectX.FXActor_X.GetComponentByName
// [0x00020501] 
struct AFXActor_X_execGetComponentByName_Parms
{
	class UClass*                                      ComponentClass;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       ComponentName;                                    		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UActorComponent*                             ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000004000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm | CPF_EditInline)
};

// Function ProjectX.FXActor_X.EventFXStatePopped
// [0x00120001] 
struct AFXActor_X_execEventFXStatePopped_Parms
{
	class AFXActor_X*                                  FXActor;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UFXActorEvent_X*                             Event;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.EventFXStatePushed
// [0x00120001] 
struct AFXActor_X_execEventFXStatePushed_Parms
{
	class AFXActor_X*                                  FXActor;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UFXActorEvent_X*                             Event;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnSpawned
// [0x00080003] 
struct AArchetypeSpawnPoint_X_execOnSpawned_Parms
{
	class AActor*                                      Spawned;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class USequenceEvent*                           Evt;                                              		// 0x0008 (0x0008) [0x0000000000000000]               
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]               
};

// Function ProjectX.ArchetypeSpawnPoint_X.DoSpawn
// [0x00020003] 
struct AArchetypeSpawnPoint_X_execDoSpawn_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class AActor*                                   Spawned;                                          		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnToggle
// [0x00020003] 
struct AArchetypeSpawnPoint_X_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnDestroy
// [0x00020102] 
struct AArchetypeSpawnPoint_X_execOnDestroy_Parms
{
	class USeqAct_Destroy*                             Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AActor*                                   A;                                                		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.ArchetypeSpawnPoint_X.PostBeginPlay
// [0x00020802] 
struct AArchetypeSpawnPoint_X_eventPostBeginPlay_Parms
{
};

// Function ProjectX.ArchetypeSpawnPoint_X.EventSpawned
// [0x00120001] 
struct AArchetypeSpawnPoint_X_execEventSpawned_Parms
{
	class AArchetypeSpawnPoint_X*                      SpawnPoint;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Spawned;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.Aws4Signature_X.SignRequest
// [0x00022401] 
struct UAws4Signature_X_execSignRequest_Parms
{
	class UHttpRequestInterface*                       HTTPRequest;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_B82198A5410540A0710FE09A74DC1F73
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_B82198A5410540A0710FE09A74DC1F73_Parms
{
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_6F226B074C691A7F12D5EF8DFB27E617
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_6F226B074C691A7F12D5EF8DFB27E617_Parms
{
	class UPsyNetBeaconConnection_X*                   Connection;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_E0AB0BC24E3249EED86A9B8C05C82845
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_E0AB0BC24E3249EED86A9B8C05C82845_Parms
{
	class UPsyNetBeacon_X*                             _;                                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UPsyNetBeaconConnection_X*                   Connection;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_9CB9982C482CC0BFA5D66D87B51987DE
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_9CB9982C482CC0BFA5D66D87B51987DE_Parms
{
	class UPsyNetBeacon_X*                             _;                                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UPsyNetBeaconConnection_X*                   Connection;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_EE3646364C1DAA98A6381AAAB6F794C6
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_EE3646364C1DAA98A6381AAAB6F794C6_Parms
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_CCA3014E462703CC6DE842823968EB47
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_CCA3014E462703CC6DE842823968EB47_Parms
{
	class UTcpBeacon*                                  _;                                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UTcpConnection*                              Connection;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_5E58B0DA4B66A265F9F6049EFED0F000
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_5E58B0DA4B66A265F9F6049EFED0F000_Parms
{
	class UTcpBeacon*                                  _;                                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UTcpConnection*                              Connection;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.ServerReserveConnection
// [0x00024003] 
struct UReservationBeacon_X_execServerReserveConnection_Parms
{
	struct FString                                     ReservationID;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FUniqueNetId                                PlayerID;                                         		// 0x0010 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              ConnectionTimeoutSeconds;                         		// 0x0058 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UIReservationConnection_X*                   ReturnValue;                                      		// 0x0060 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ReservationBeacon_X.BeginPsyNetConnect
// [0x00020003] 
struct UReservationBeacon_X_execBeginPsyNetConnect_Parms
{
	struct FString                                     ReservationID;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     DSRToken;                                         		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UIReservationConnection_X*                   ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ReservationBeacon_X.BeginTcpConnect
// [0x00020003] 
struct UReservationBeacon_X_execBeginTcpConnect_Parms
{
	struct FString                                     BeaconURL;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UIReservationConnection_X*                   ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ReservationBeacon_X.BeginConnect
// [0x00020003] 
struct UReservationBeacon_X_execBeginConnect_Parms
{
	struct FServerReservationData                      Reservation;                                      		// 0x0000 (0x0080) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UIReservationConnection_X*                   ReturnValue;                                      		// 0x0080 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ReservationBeacon_X.Close
// [0x00020003] 
struct UReservationBeacon_X_execClose_Parms
{
};

// Function ProjectX.ReservationBeacon_X.CloseConnection
// [0x00020003] 
struct UReservationBeacon_X_execCloseConnection_Parms
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	// class UTcpConnection*                           TcpConnection;                                    		// 0x0010 (0x0008) [0x0000000000000000]               
	// class UPsyNetBeaconConnection_X*                PsyNetConnection;                                 		// 0x0018 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.ReservationBeacon_X.BroadcastMessage
// [0x00020803] 
struct UReservationBeacon_X_eventBroadcastMessage_Parms
{
	class UObject*                                     Message;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.SendMessage
// [0x00020803] 
struct UReservationBeacon_X_eventSendMessage_Parms
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class UTcpConnection*                           TcpConnection;                                    		// 0x0018 (0x0008) [0x0000000000000000]               
	// class UPsyNetBeaconConnection_X*                PsyNetConnection;                                 		// 0x0020 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.ReservationBeacon_X.CreateMessage
// [0x00020401] 
struct UReservationBeacon_X_execCreateMessage_Parms
{
	class UClass*                                      MessageClass;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function ProjectX.ReservationBeacon_X.ReceiveMessage
// [0x00020401] 
struct UReservationBeacon_X_execReceiveMessage_Parms
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.RemoveMessageHandler
// [0x00020401] 
struct UReservationBeacon_X_execRemoveMessageHandler_Parms
{
	struct FScriptDelegate                             Callback;                                         		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.ReservationBeacon_X.AddMessageHandler
// [0x00020401] 
struct UReservationBeacon_X_execAddMessageHandler_Parms
{
	class UClass*                                      MessageClass;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             Callback;                                         		// 0x0008 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.ReservationBeacon_X.BeginListen
// [0x00020003] 
struct UReservationBeacon_X_execBeginListen_Parms
{
};

// Function ProjectX.ReservationBeacon_X.Construct
// [0x00020802] 
struct UReservationBeacon_X_eventConstruct_Parms
{
};

// Function ProjectX.ReservationBeacon_X.EventDisconnected
// [0x00120001] 
struct UReservationBeacon_X_execEventDisconnected_Parms
{
	class UReservationBeacon_X*                        Beacon;                                           		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UIReservationConnection_X*                   Connection;                                       		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.EventConnected
// [0x00120001] 
struct UReservationBeacon_X_execEventConnected_Parms
{
	class UReservationBeacon_X*                        Beacon;                                           		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UIReservationConnection_X*                   Connection;                                       		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.MessageReceivedDelegate
// [0x00140001] 
struct UReservationBeacon_X_execMessageReceivedDelegate_Parms
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.BeaconMessage_X.Broadcast
// [0x00020401] 
struct UBeaconMessage_X_execBroadcast_Parms
{
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.BeaconMessage_X.Send
// [0x00020401] 
struct UBeaconMessage_X_execSend_Parms
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.BugReport_X.HandleHttpRequestComplete
// [0x00040401] 
struct UBugReport_X_execHandleHttpRequestComplete_Parms
{
	class UHttpRequestInterface*                       OriginalRequest;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UHttpResponseInterface*                      InHttpResponse;                                   		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               bDidSucceed : 1;                                  		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function ProjectX.BugReport_X.LogText
// [0x00040401] 
struct UBugReport_X_execLogText_Parms
{
	struct FString                                     Str;                                              		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function ProjectX.BugReport_X.PDIReport
// [0x00080803] 
struct UBugReport_X_eventPDIReport_Parms
{
	// class AActor*                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000000]               
	// class UDebugDrawer*                             Drawer;                                           		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.BugReport_X.CancelBugReport
// [0x00020401] 
struct UBugReport_X_execCancelBugReport_Parms
{
};

// Function ProjectX.BugReport_X.SubmitBugReport
// [0x00024401] 
struct UBugReport_X_execSubmitBugReport_Parms
{
	struct FString                                     Title;                                            		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     Description;                                      		// 0x0010 (0x0010) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     Email;                                            		// 0x0020 (0x0010) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.BugReport_X.StartBugReport
// [0x00020401] 
struct UBugReport_X_execStartBugReport_Parms
{
};

// Function ProjectX.BugReport_X.StaticSubmitBugReport
// [0x00022003] 
struct UBugReport_X_execStaticSubmitBugReport_Parms
{
	struct FString                                     Title;                                            		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.BugReport_X.CreateBugReport
// [0x00022401] 
struct UBugReport_X_execCreateBugReport_Parms
{
	class UBugReport_X*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.CachedWebData_X.GetText
// [0x00020401] 
struct UCachedWebData_X_execGetText_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX.CachedWebData_X.SetData
// [0x00020401] 
struct UCachedWebData_X_execSetData_Parms
{
	TArray<unsigned char>                              NewData;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     NewETag;                                          		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     NewContentType;                                   		// 0x0020 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     NewSignature;                                     		// 0x0030 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.Camera_X.__Camera_X__Destroyed_EE24F77E46538B75EA15938858D62907
// [0x40040003] 
struct ACamera_X_exec__Camera_X__Destroyed_EE24F77E46538B75EA15938858D62907_Parms
{
