/*
#############################################################################################
# Rocket League (210513.57953.327225) SDK
# Generated with the UE3SDKGenerator v4.2.0
# ========================================================================================= #
# File: ProjectX_structs.h
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK, Crunchy
# Links: www.github.com/ItsBranK/UE3SDKGenerator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once
#include "../SdkConstants.hpp"

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct ProjectX._SharedHelpers.Orientation
// 0x0018
struct FOrientation
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000000]               
	struct FRotator                                    Rotation;                                         		// 0x000C (0x000C) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ClubColorSet
// 0x0008
struct FClubColorSet
{
	unsigned char                                      TeamColorID;                                      		// 0x0000 (0x0001) [0x0000000000000000]               
	unsigned char                                      CustomColorID;                                    		// 0x0001 (0x0001) [0x0000000000000000]               
	unsigned long                                      bTeamColorSet : 1;                                		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bCustomColorSet : 1;                              		// 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct ProjectX._Types_X.CustomMatchTeamSettings
// 0x001C
struct FCustomMatchTeamSettings
{
	struct FString                                     Name;                                             		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FClubColorSet                               Colors;                                           		// 0x0010 (0x0008) [0x0000000000000000]               
	int                                                GameScore;                                        		// 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.CustomMatchSettings
// 0x008C
struct FCustomMatchSettings
{
	struct FString                                     GameTags;                                         		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FName                                       MapName;                                          		// 0x0010 (0x0008) [0x0000000000000000]               
	unsigned char                                      GameMode;                                         		// 0x0018 (0x0001) [0x0000000000000000]               
	int                                                MaxPlayerCount;                                   		// 0x001C (0x0004) [0x0000000000000000]               
	struct FString                                     ServerName;                                       		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     Password;                                         		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long                                      bPublic : 1;                                      		// 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FCustomMatchTeamSettings                    TeamSettings[0x2];                                		// 0x0048 (0x0040) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long                                      bClubServer : 1;                                  		// 0x0088 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.JoinMatchSettings
// 0x0020
struct FJoinMatchSettings
{
	unsigned char                                      MatchType;                                        		// 0x0000 (0x0001) [0x0000000000000000]               
	int                                                PlaylistId;                                       		// 0x0004 (0x0004) [0x0000000000000000]               
	unsigned long                                      bFriendJoin : 1;                                  		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bMigration : 1;                                   		// 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bRankedReconnect : 1;                             		// 0x0008 (0x0004) [0x0000000000000000] [0x00000004] 
	struct FString                                     Password;                                         		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.SkillMatchPlayer
// 0x005C
struct FSkillMatchPlayer
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              PctTimePlayed;                                    		// 0x0048 (0x0004) [0x0000000000000000]               
	unsigned long                                      bQuitter : 1;                                     		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                PartyID;                                          		// 0x0050 (0x0004) [0x0000000000000000]               
	int                                                Score;                                            		// 0x0054 (0x0004) [0x0000000000000000]               
	int                                                Team;                                             		// 0x0058 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PartyJoinMatchSettings
// 0x0068
struct FPartyJoinMatchSettings
{
	struct FString                                     ServerName;                                       		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     BeaconAddress;                                    		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                PlaylistId;                                       		// 0x0020 (0x0004) [0x0000000000000000]               
	unsigned long                                      bFriendJoin : 1;                                  		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     CustomPassword;                                   		// 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     ReservationID;                                    		// 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     JoinName;                                         		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     JoinPassword;                                     		// 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.ServerResult
// 0x00B0
struct FServerResult
{
	struct FString                                     Address;                                          		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     ServerName;                                       		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FCustomMatchSettings                        Settings;                                         		// 0x0020 (0x0090) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.OnlineStatus
// 0x0059
struct FOnlineStatus
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PresenceInfo;                                     		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned char                                      PresenceState;                                    		// 0x0058 (0x0001) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ServerReservationData
// 0x0080
struct FServerReservationData
{
	struct FString                                     BeaconURL;                                        		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     ServerName;                                       		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                Playlist;                                         		// 0x0020 (0x0004) [0x0000000000000000]               
	struct FString                                     Region;                                           		// 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     ReservationID;                                    		// 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     DSRToken;                                         		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UNetworkEncryptionKey*                       Keys;                                             		// 0x0058 (0x0008) [0x0000000000000000]               
	struct FString                                     JoinName;                                         		// 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     JoinPassword;                                     		// 0x0070 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.CheckReservationResponse
// 0x007C
struct FCheckReservationResponse
{
	struct FString                                     IP;                                               		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     ServerName;                                       		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                Playlist;                                         		// 0x0020 (0x0004) [0x0000000000000000]               
	struct FString                                     Region;                                           		// 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     Host;                                             		// 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                Port;                                             		// 0x0048 (0x0004) [0x0000000000000000]               
	struct FString                                     ReservationID;                                    		// 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     DSConnectToken;                                   		// 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UNetworkEncryptionKey*                       Keys;                                             		// 0x0070 (0x0008) [0x0000000000000000]               
	unsigned long                                      IsServerKey : 1;                                  		// 0x0078 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.MapPrefs
// 0x0020
struct FMapPrefs
{
	TArray<struct FName>                               Likes;                                            		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               Dislikes;                                         		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.RegionSecret
// 0x0020
struct FRegionSecret
{
	struct FString                                     Region;                                           		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     Secret;                                           		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PsyNetPersonaData
// 0x0090
struct FPsyNetPersonaData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PlayerName;                                       		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PresenceInfo;                                     		// 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PresenceState;                                    		// 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FPsyTag                                     PsyTag;                                           		// 0x0078 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.BumpAngleCheckConfig
// 0x0014
struct FBumpAngleCheckConfig
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              BumpAngleYaw;                                     		// 0x0004 (0x0004) [0x0000000000000000]               
	float                                              BumpAnglePitch;                                   		// 0x0008 (0x0004) [0x0000000000000000]               
	float                                              DemolishAngleYaw;                                 		// 0x000C (0x0004) [0x0000000000000000]               
	float                                              DemolishAnglePitch;                               		// 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.BumpAngleCurveCheckConfig
// 0x0068
struct FBumpAngleCurveCheckConfig
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FInterpCurveFloat                           BumpAngleCurveYaw;                                		// 0x0008 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           BumpAngleCurvePitch;                              		// 0x0020 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           DemolishAngleCurveYaw;                            		// 0x0038 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           DemolishAngleCurvePitch;                          		// 0x0050 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.CarInteractionConfig
// 0x0104
struct FCarInteractionConfig
{
	float                                              PushFactor;                                       		// 0x0000 (0x0004) [0x0000000000000000]               
	struct FInterpCurveFloat                           BumperPushFactorCurveGround;                      		// 0x0008 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           BumperPushFactorCurveAir;                         		// 0x0020 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FInterpCurveFloat                           ZPushFactorCurve;                                 		// 0x0038 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              BumpInterval;                                     		// 0x0050 (0x0004) [0x0000000000000000]               
	struct FBumpAngleCheckConfig                       COMAngleCheck;                                    		// 0x0054 (0x0014) [0x0000000000000000]               
	struct FBumpAngleCheckConfig                       VictimHitAngleCheck;                              		// 0x0068 (0x0014) [0x0000000000000000]               
	struct FBumpAngleCheckConfig                       AttackerHitAngleCheck;                            		// 0x007C (0x0014) [0x0000000000000000]               
	struct FBumpAngleCurveCheckConfig                  VictimHitAngleCurveCheck;                         		// 0x0090 (0x0068) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long                                      bCheckImpactNormal : 1;                           		// 0x00F8 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ImpactNormalDotProductDemo;                       		// 0x00FC (0x0004) [0x0000000000000000]               
	float                                              ImpactNormalDotProductBump;                       		// 0x0100 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.SuperSonicConfig
// 0x000C
struct FSuperSonicConfig
{
	float                                              Speed;                                            		// 0x0000 (0x0004) [0x0000000000000000]               
	float                                              TurnoffSpeedBuffer;                               		// 0x0004 (0x0004) [0x0000000000000000]               
	float                                              TurnoffTime;                                      		// 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.SkillRating
// 0x0008
struct FSkillRating
{
	float                                              Mu;                                               		// 0x0000 (0x0004) [0x0000000000000000]               
	float                                              Sigma;                                            		// 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.MigrationReservationData
// 0x00E0
struct FMigrationReservationData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PlayerName;                                       		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                PartyID;                                          		// 0x0058 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned char                                      Status;                                           		// 0x00A0 (0x0001) [0x0000000000000000]               
	unsigned long                                      bDisableCrossPlay : 1;                            		// 0x00A4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      Team;                                             		// 0x00A8 (0x0001) [0x0000000000000000]               
	struct FSkillRating                                Skill;                                            		// 0x00AC (0x0008) [0x0000000000000000]               
	TArray<struct FName>                               MapLikes;                                         		// 0x00B8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapDislikes;                                      		// 0x00C8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UNetworkEncryptionKey*                       SecurityKey;                                      		// 0x00D8 (0x0008) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ReservationData
// 0x0108
struct FReservationData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PlayerName;                                       		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                PartyID;                                          		// 0x0058 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned char                                      Status;                                           		// 0x00A0 (0x0001) [0x0000000000000000]               
	float                                              TimeoutTime;                                      		// 0x00A4 (0x0004) [0x0000000000000000]               
	unsigned long                                      bDisableCrossPlay : 1;                            		// 0x00A8 (0x0004) [0x0000000000000000] [0x00000001] 
	class APlayerReplicationInfo*                      PRI;                                              		// 0x00B0 (0x0008) [0x0000000000000000]               
	unsigned char                                      Team;                                             		// 0x00B8 (0x0001) [0x0000000000000000]               
	class UAddReservationMessage_X*                    ReservationMessage;                               		// 0x00C0 (0x0008) [0x0000000000000000]               
	class UIReservationConnection_X*                   Connection;                                       		// 0x00C8 (0x0010) [0x0000000000000000]               
	unsigned char                                      UnknownData00[0x8];                               		// 0x00D0 (0x0008) FIX WRONG SIZE OF PREVIOUS PROPERTY
	unsigned long                                      bIgnoreBeaconDisconnect : 1;                      		// 0x00D8 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FSkillRating                                Skill;                                            		// 0x00DC (0x0008) [0x0000000000000000]               
	TArray<struct FName>                               MapLikes;                                         		// 0x00E8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapDislikes;                                      		// 0x00F8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PlayerTitleData
// 0x0028
struct FPlayerTitleData
{
	struct FName                                       Id;                                               		// 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FString                                     Text;                                             		// 0x0008 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	struct FName                                       Category;                                         		// 0x0018 (0x0008) [0x0000000000000000]               
	struct FColor                                      Color;                                            		// 0x0020 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FColor                                      GlowColor;                                        		// 0x0024 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct ProjectX._Types_X.PlayerSeasonRewardProgress
// 0x0050
struct FPlayerSeasonRewardProgress
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                Level;                                            		// 0x0048 (0x0004) [0x0000000000000000]               
	int                                                Wins;                                             		// 0x004C (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ActiveServerData
// 0x00C0
struct FActiveServerData
{
	struct FServerReservationData                      Reservation;                                      		// 0x0000 (0x0080) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     BeaconURL;                                        		// 0x0080 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PingURL;                                          		// 0x0090 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     GameURL;                                          		// 0x00A0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     JoinCredentials;                                  		// 0x00B0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.CrossplayGroup
// 0x0010
struct FCrossplayGroup
{
	TArray<unsigned char>                              Platforms;                                        		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.ServerConnectionInfo
// 0x0040
struct FServerConnectionInfo
{
	struct FString                                     ServerAddress;                                    		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     BeaconAddress;                                    		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PingAddress;                                      		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     ServerName;                                       		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.TierSkillRating
// 0x0014(0x001C - 0x0008)
struct FTierSkillRating : FSkillRating
{
	int                                                Tier;                                             		// 0x0008 (0x0004) [0x0000000000000000]               
	int                                                Division;                                         		// 0x000C (0x0004) [0x0000000000000000]               
	int                                                MatchesPlayed;                                    		// 0x0010 (0x0004) [0x0000000000000000]               
	int                                                PlacementMatchesPlayed;                           		// 0x0014 (0x0004) [0x0000000000000000]               
	float                                              MMR;                                              		// 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.SkillMatchPartyRating
// 0x0004(0x0020 - 0x001C)
struct FSkillMatchPartyRating : FTierSkillRating
{
	int                                                PartyID;                                          		// 0x001C (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.SkillMatchParty
// 0x0020
struct FSkillMatchParty
{
	int                                                PartyID;                                          		// 0x0000 (0x0004) [0x0000000000000000]               
	float                                              PctTimePlayed;                                    		// 0x0004 (0x0004) [0x0000000000000000]               
	unsigned long                                      bQuitter : 1;                                     		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray<struct FUniqueNetId>                        Players;                                          		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.SkillMatchData
// 0x001C
struct FSkillMatchData
{
	unsigned long long                                 ServerId;                                         		// 0x0000 (0x0008) [0x0000000000000000]               
	int                                                Playlist;                                         		// 0x0008 (0x0004) [0x0000000000000000]               
	int                                                WinningTeam;                                      		// 0x000C (0x0004) [0x0000000000000000]               
	int                                                Team0Score;                                       		// 0x0010 (0x0004) [0x0000000000000000]               
	int                                                Team1Score;                                       		// 0x0014 (0x0004) [0x0000000000000000]               
	unsigned long                                      bOverTime : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.ReplicatedReservationData
// 0x0059
struct FReplicatedReservationData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PlayerName;                                       		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned char                                      Status;                                           		// 0x0058 (0x0001) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ReservationPlayerData
// 0x00A0
struct FReservationPlayerData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PlayerName;                                       		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              SkillMu;                                          		// 0x0058 (0x0004) [0x0000000000000000]               
	float                                              SkillSigma;                                       		// 0x005C (0x0004) [0x0000000000000000]               
	int                                                Tier;                                             		// 0x0060 (0x0004) [0x0000000000000000]               
	unsigned long                                      bRemotePlayer : 1;                                		// 0x0064 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray<int>                                        Loadout;                                          		// 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapLikes;                                         		// 0x0078 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapDislikes;                                      		// 0x0088 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long long                                 ClubID;                                           		// 0x0098 (0x0008) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ReplicatedRBStateNoQuat
// 0x0038
struct FReplicatedRBStateNoQuat
{
	float                                              QuatX;                                            		// 0x0000 (0x0004) [0x0000000000000000]               
	float                                              QuatY;                                            		// 0x0004 (0x0004) [0x0000000000000000]               
	float                                              QuatZ;                                            		// 0x0008 (0x0004) [0x0000000000000000]               
	float                                              QuatW;                                            		// 0x000C (0x0004) [0x0000000000000000]               
	struct FVector                                     Location;                                         		// 0x0010 (0x000C) [0x0000000000000000]               
	struct FVector                                     LinearVelocity;                                   		// 0x001C (0x000C) [0x0000000000000000]               
	struct FVector                                     AngularVelocity;                                  		// 0x0028 (0x000C) [0x0000000000000000]               
	unsigned long                                      bSleeping : 1;                                    		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX._Types_X.ReplicatedRBState
// 0x003C
struct FReplicatedRBState
{
	struct FQuat                                       Quaternion;                                       		// 0x0000 (0x0010) [0x0000000000000000]               
	struct FVector                                     Location;                                         		// 0x0010 (0x000C) [0x0000000000000000]               
	struct FVector                                     LinearVelocity;                                   		// 0x001C (0x000C) [0x0000000000000000]               
	struct FVector                                     AngularVelocity;                                  		// 0x0028 (0x000C) [0x0000000000000000]               
	float                                              Time;                                             		// 0x0034 (0x0004) [0x0000000000000000]               
	unsigned long                                      bSleeping : 1;                                    		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bNewData : 1;                                     		// 0x0038 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct ProjectX._Types_X.PlayerBinding
// 0x002C
struct FPlayerBinding
{
	struct FName                                       Action;                                           		// 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FName                                       Key;                                              		// 0x0008 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	unsigned char                                      AxisSign;                                         		// 0x0010 (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
	unsigned char                                      PressType;                                        		// 0x0011 (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
	float                                              Speed;                                            		// 0x0014 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	unsigned long                                      bRequired : 1;                                    		// 0x0018 (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
	unsigned char                                      Remappable;                                       		// 0x001C (0x0001) [0x0000000000000000]               
	float                                              PressedTime;                                      		// 0x0020 (0x0004) [0x0000000000002000] (CPF_Transient)
	float                                              ReleasedTime;                                     		// 0x0024 (0x0004) [0x0000000000002000] (CPF_Transient)
	unsigned long                                      bTapped : 1;                                      		// 0x0028 (0x0004) [0x0000000000002000] [0x00000001] (CPF_Transient)
	unsigned long                                      bToggled : 1;                                     		// 0x0028 (0x0004) [0x0000000000002000] [0x00000002] (CPF_Transient)
};

// ScriptStruct ProjectX._Types_X.BindingAction
// 0x0038
struct FBindingAction
{
	struct FName                                       Action;                                           		// 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FName                                       Category;                                         		// 0x0008 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FName                                       Axis;                                             		// 0x0010 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	unsigned char                                      AxisSign;                                         		// 0x0018 (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FString                                     Command;                                          		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long                                      bDisableRemapping : 1;                            		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                Priority;                                         		// 0x0034 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PlaylistTierSkillRating
// 0x0004(0x0020 - 0x001C)
struct FPlaylistTierSkillRating : FTierSkillRating
{
	int                                                Playlist;                                         		// 0x001C (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PlayerSkillRating
// 0x004C(0x0068 - 0x001C)
struct FPlayerSkillRating : FTierSkillRating
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0020 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PlaylistSkillRating
// 0x0004(0x006C - 0x0068)
struct FPlaylistSkillRating : FPlayerSkillRating
{
	int                                                Playlist;                                         		// 0x0068 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.UpdatedPlayerSkillRating
// 0x0010(0x0078 - 0x0068)
struct FUpdatedPlayerSkillRating : FPlayerSkillRating
{
	float                                              PrevMu;                                           		// 0x0068 (0x0004) [0x0000000000000000]               
	float                                              PrevSigma;                                        		// 0x006C (0x0004) [0x0000000000000000]               
	int                                                PrevTier;                                         		// 0x0070 (0x0004) [0x0000000000000000]               
	int                                                PrevDivision;                                     		// 0x0074 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.RPCRewardLevelData
// 0x0008
struct FRPCRewardLevelData
{
	int                                                SeasonLevel;                                      		// 0x0000 (0x0004) [0x0000000000000000]               
	int                                                SeasonLevelWins;                                  		// 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.RPCPlayerRewardLevelData
// 0x0048(0x0050 - 0x0008)
struct FRPCPlayerRewardLevelData : FRPCRewardLevelData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.CachedRegionPing
// 0x000C
struct FCachedRegionPing
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Ping;                                             		// 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PartyMemberServer
// 0x0054
struct FPartyMemberServer
{
	struct FString                                     ServerName;                                       		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     BeaconAddress;                                    		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     CustomPassword;                                   		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     JoinName;                                         		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     JoinPassword;                                     		// 0x0040 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                PlaylistId;                                       		// 0x0050 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PartyMember
// 0x0178
struct FPartyMember
{
	struct FUniqueNetId                                PrimaryMemberId;                                  		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                MemberId;                                         		// 0x0048 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     MemberName;                                       		// 0x0090 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                MatchmakeRestrictions;                            		// 0x00A0 (0x0004) [0x0000000000000000]               
	int                                                LocalControllerId;                                		// 0x00A4 (0x0004) [0x0000000000000000]               
	unsigned char                                      CrossChatState;                                   		// 0x00A8 (0x0001) [0x0000000000000000]               
	unsigned long                                      bDisableCrossPlay : 1;                            		// 0x00AC (0x0004) [0x0000000000000000] [0x00000001] 
	struct FUniqueNetId                                TradingMemberId;                                  		// 0x00B0 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FGuid                                       TradeId;                                          		// 0x00F8 (0x0010) [0x0000000000000000]               
	unsigned long                                      bReadyToTrade : 1;                                		// 0x0108 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FPartyMemberServer                          Server;                                           		// 0x0110 (0x0058) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueLobbyId                              PlatformParty;                                    		// 0x0168 (0x0010) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.PlayerTitleCategory
// 0x0028
struct FPlayerTitleCategory
{
	struct FName                                       Id;                                               		// 0x0000 (0x0008) [0x0000000000000000]               
	struct FString                                     Color;                                            		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     GlowColor;                                        		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.RenderProfile
// 0x0028
struct FRenderProfile
{
	float                                              GameThreadTime;                                   		// 0x0000 (0x0004) [0x0000000000000000]               
	float                                              RenderThreadTime;                                 		// 0x0004 (0x0004) [0x0000000000000000]               
	float                                              GPUTime;                                          		// 0x0008 (0x0004) [0x0000000000000000]               
	float                                              FrameTime;                                        		// 0x000C (0x0004) [0x0000000000000000]               
	float                                              FPS;                                              		// 0x0010 (0x0004) [0x0000000000000000]               
	float                                              AccumGameThreadTime;                              		// 0x0014 (0x0004) [0x0000000000000000]               
	float                                              AccumRenderThreadTime;                            		// 0x0018 (0x0004) [0x0000000000000000]               
	float                                              AccumGPUTime;                                     		// 0x001C (0x0004) [0x0000000000000000]               
	float                                              AccumFrameTime;                                   		// 0x0020 (0x0004) [0x0000000000000000]               
	int                                                NumSamples;                                       		// 0x0024 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.MetricsEvent
// 0x0070
struct FMetricsEvent
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              TimeSeconds;                                      		// 0x0048 (0x0004) [0x0000000000000000]               
	int                                                Version;                                          		// 0x004C (0x0004) [0x0000000000000000]               
	struct FString                                     EventName;                                        		// 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     EventData;                                        		// 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.IntVector3
// 0x000C
struct FIntVector3
{
	int                                                X;                                                		// 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int                                                Y;                                                		// 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int                                                Z;                                                		// 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct ProjectX._Types_X.DownloadedImage
// 0x0018
struct FDownloadedImage
{
	struct FString                                     URL;                                              		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UTexture2DDynamic*                           Texture;                                          		// 0x0010 (0x0008) [0x0000000000000000]               
};

// ScriptStruct ProjectX._Types_X.ClubMember
// 0x0058
struct FClubMember
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PlayerName;                                       		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.PlayerPermissionsList
// 0x0058
struct FPlayerPermissionsList
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<unsigned char>                              Permissions;                                      		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX._Types_X.NetStats
// 0x000C
struct FNetStats
{
	float                                              PingMin;                                          		// 0x0000 (0x0004) [0x0000000000000000]               
	float                                              Jitter;                                           		// 0x0004 (0x0004) [0x0000000000000000]               
	float                                              LossPct;                                          		// 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX.AddReservationMessagePublic_X.OnlinePlayerMapPrefs
// 0x0068
struct FOnlinePlayerMapPrefs
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapLikes;                                         		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FName>                               MapDislikes;                                      		// 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedParam
// 0x0008
struct FAnimatedParam
{
	struct FName                                       ParamName;                                        		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedFloatParam
// 0x0018(0x0020 - 0x0008)
struct FAnimatedFloatParam : FAnimatedParam
{
	struct FInterpCurveFloat                           ValueOverTime;                                    		// 0x0008 (0x0018) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedVectorParam
// 0x0018(0x0020 - 0x0008)
struct FAnimatedVectorParam : FAnimatedParam
{
	struct FInterpCurveVector                          ValueOverTime;                                    		// 0x0008 (0x0018) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.AnimateParametersComponent_X.AnimatedLinearColorParam
// 0x0018(0x0020 - 0x0008)
struct FAnimatedLinearColorParam : FAnimatedParam
{
	struct FInterpCurveLinearColor                     ValueOverTime;                                    		// 0x0008 (0x0018) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.BugReport_X.BugReportSubmitterData
// 0x0030
struct FBugReportSubmitterData
{
	class APlayerController*                           Submitter;                                        		// 0x0000 (0x0008) [0x0000000000000000]               
	struct FString                                     Name;                                             		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FVector                                     Location;                                         		// 0x0018 (0x000C) [0x0000000000000000]               
	struct FRotator                                    Rotation;                                         		// 0x0024 (0x000C) [0x0000000000000000]               
};

// ScriptStruct ProjectX.BugReport_X.BugReportSystemData
// 0x0034
struct FBugReportSystemData
{
	struct FString                                     ComputerName;                                     		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     GameName;                                         		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     NetMode;                                          		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long                                      bClient : 1;                                      		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX.BugReport_X.BugReportPathData
// 0x0040
struct FBugReportPathData
{
	struct FString                                     OutputPath;                                       		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     LogName;                                          		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     LogPath;                                          		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     ScreenShotPath;                                   		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.BugReport_X.BugReportDescriptionData
// 0x0050
struct FBugReportDescriptionData
{
	struct FString                                     Title;                                            		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     ShortTitle;                                       		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     MetaTitle;                                        		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     Description;                                      		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     Email;                                            		// 0x0040 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.BugReport_X.FileUploadData
// 0x0039
struct FFileUploadData
{
	class UBugReport_X*                                BugReport;                                        		// 0x0000 (0x0008) [0x0000000000000000]               
	struct FString                                     BugID;                                            		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     Folder;                                           		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     FilePath;                                         		// 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned char                                      TruncateType;                                     		// 0x0038 (0x0001) [0x0000000000000000]               
};

// ScriptStruct ProjectX.BugReport_X.BugReportUploadTask
// 0x00A0
struct FBugReportUploadTask
{
	struct FFileUploadData                             Data;                                             		// 0x0000 (0x0040) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FBugReportSystemData                        SystemData;                                       		// 0x0040 (0x0038) [0x0000000000400000] (CPF_NeedCtorLink)
	class UHttpRequestInterface*                       HTTPRequest;                                      		// 0x0078 (0x0008) [0x0000000000000000]               
	struct FString                                     TaskName;                                         		// 0x0080 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
	struct FString                                     Error;                                            		// 0x0090 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.Camera_X.CameraKnockBase
// 0x0010
struct FCameraKnockBase
{
	float                                              BlendInTime;                                      		// 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BlendOutTime;                                     		// 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Falloff;                                          		// 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Time;                                             		// 0x000C (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct ProjectX.Camera_X.CameraOrientation
// 0x002C
struct FCameraOrientation
{
	struct FVector                                     Focus;                                            		// 0x0000 (0x000C) [0x0000000000000000]               
	struct FRotator                                    Rotation;                                         		// 0x000C (0x000C) [0x0000000000000000]               
	float                                              Distance;                                         		// 0x0018 (0x0004) [0x0000000000000000]               
	float                                              FOV;                                              		// 0x001C (0x0004) [0x0000000000000000]               
	struct FVector                                     CalculatedLocation;                               		// 0x0020 (0x000C) [0x0000000000000000]               
};

// ScriptStruct ProjectX.CameraStateBlender_X.CameraTransition
// 0x004C
struct FCameraTransition
{
	class UCameraState_X*                              CameraState;                                      		// 0x0000 (0x0008) [0x0000000000000000]               
	struct FViewTargetTransitionParams                 BlendParams;                                      		// 0x0008 (0x0010) [0x0000000000000000]               
	float                                              RemainingTime;                                    		// 0x0018 (0x0004) [0x0000000000000000]               
	struct FCameraOrientation                          SnapshotPOV;                                      		// 0x001C (0x002C) [0x0000000000000000]               
	unsigned long                                      bStarted : 1;                                     		// 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct ProjectX.Camera_X.RotationCameraKnock
// 0x000C(0x001C - 0x0010)
struct FRotationCameraKnock : FCameraKnockBase
{
	struct FRotator                                    Amount;                                           		// 0x0010 (0x000C) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct ProjectX.Camera_X.LocationCameraKnock
// 0x000C(0x001C - 0x0010)
struct FLocationCameraKnock : FCameraKnockBase
{
	struct FVector                                     Amount;                                           		// 0x0010 (0x000C) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct ProjectX.Camera_X.VectorInterpRate
// 0x0018
struct FVectorInterpRate
{
	float                                              MaxDistance;                                      		// 0x0000 (0x0004) [0x0000000000000000]               
	float                                              InterpRate;                                       		// 0x0004 (0x0004) [0x0000000000000000]               
	float                                              ForwardScale;                                     		// 0x0008 (0x0004) [0x0000000000000000]               
	float                                              BackwardScale;                                    		// 0x000C (0x0004) [0x0000000000000000]               
	float                                              SideScale;                                        		// 0x0010 (0x0004) [0x0000000000000000]               
	float                                              UpDownScale;                                      		// 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct ProjectX.CheatManager_X.TestStructEvent
// 0x0018
struct FTestStructEvent
{
	struct FScriptDelegate                             Callback;                                         		// 0x0000 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct ProjectX.EffectsMap_X.EffectsMapping
// 0x0010
