/*
#############################################################################################
# Rocket League (210617.48985.332260) SDK
# Generated with the UE3SDKGenerator v4.2.0
# ========================================================================================= #
# File: TAGame_structs.h
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK, Crunchy
# Links: www.github.com/ItsBranK/UE3SDKGenerator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct TAGame._AITypes_TA.BTDynamicLinkData
// 0x0010
struct FBTDynamicLinkData
{
	struct FName                                       LinkName;                                         		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UBTNode*                                     Node;                                             		// 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._AITypes_TA.AICachedGoalInfo
// 0x0014
struct FAICachedGoalInfo
{
	class UGoal_TA*                                    Goal;                                             		// 0x0000 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	struct FVector                                     FieldSize;                                        		// 0x0008 (0x000C) [0x0000000000000000]               
};

// ScriptStruct TAGame._AITypes_TA.AIProxyData
// 0x0048
struct FAIProxyData
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000000]               
	struct FVector                                     Velocity;                                         		// 0x000C (0x000C) [0x0000000000000000]               
	struct FVector                                     Gravity;                                          		// 0x0018 (0x000C) [0x0000000000000000]               
	struct FRotator                                    Rotation;                                         		// 0x0024 (0x000C) [0x0000000000000000]               
	float                                              Radius;                                           		// 0x0030 (0x0004) [0x0000000000000000]               
	float                                              Bounce;                                           		// 0x0034 (0x0004) [0x0000000000000000]               
	class AActor*                                      Actor;                                            		// 0x0038 (0x0008) [0x0000000000000000]               
	class AVehicle_TA*                                 Vehicle;                                          		// 0x0040 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.GameModeData
// 0x0018
struct FGameModeData
{
	int                                                GameMode;                                         		// 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FString                                     LocalizedName;                                    		// 0x0008 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.PlayerChatMessage
// 0x0068
struct FPlayerChatMessage
{
	float                                              MessageTimeStamp;                                 		// 0x0000 (0x0004) [0x0000000000000000]               
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned char                                      ChatChannel;                                      		// 0x0050 (0x0001) [0x0000000000000000]               
	int                                                Team;                                             		// 0x0054 (0x0004) [0x0000000000000000]               
	struct FString                                     Message;                                          		// 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ReportPlayerData
// 0x0058
struct FReportPlayerData
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     PlayerName;                                       		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ReportedPlayerInfo
// 0x00B8
struct FReportedPlayerInfo
{
	struct FReportPlayerData                           Reporter;                                         		// 0x0000 (0x0058) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FReportPlayerData                           Offender;                                         		// 0x0058 (0x0058) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned char                                      ReasonID;                                         		// 0x00B0 (0x0001) [0x0000000000000000]               
	float                                              ReportTimeStamp;                                  		// 0x00B4 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.AssetLoadResult
// 0x0020
struct FAssetLoadResult
{
	int                                                ProductID;                                        		// 0x0000 (0x0004) [0x0000000000000000]               
	struct FName                                       AssetName;                                        		// 0x0004 (0x0008) [0x0000000000000000]               
	class UProductAsset_TA*                            Asset;                                            		// 0x0010 (0x0008) [0x0000000000000000]               
	class UProductThumbnailAsset_TA*                   ThumbnailAsset;                                   		// 0x0018 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutData
// 0x0010
struct FClientLoadoutData
{
	TArray<int>                                        Products;                                         		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamColor
// 0x0008
struct FLoadoutTeamColor
{
	unsigned char                                      Team;                                             		// 0x0000 (0x0001) [0x0000000000000000]               
	unsigned char                                      TeamColorID;                                      		// 0x0001 (0x0001) [0x0000000000000000]               
	unsigned char                                      CustomColorID;                                    		// 0x0002 (0x0001) [0x0000000000000000]               
	unsigned long                                      bSet : 1;                                         		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamPaint
// 0x0008(0x0010 - 0x0008)
struct FLoadoutTeamPaint : FLoadoutTeamColor
{
	int                                                TeamFinishID;                                     		// 0x0008 (0x0004) [0x0000000000000000]               
	int                                                CustomFinishID;                                   		// 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.LoadoutData
// 0x0030(0x0040 - 0x0010)
struct FLoadoutData : FClientLoadoutData
{
	struct FLoadoutTeamPaint                           TeamPaint;                                        		// 0x0010 (0x0010) [0x0000000000000000]               
	struct FName                                       Title;                                            		// 0x0020 (0x0008) [0x0000000000000000]               
	int                                                TeamIndex;                                        		// 0x0028 (0x0004) [0x0000000000000000]               
	TArray<unsigned long long>                         OnlineProducts;                                   		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutOnlineProduct
// 0x0010
struct FClientLoadoutOnlineProduct
{
	TArray<class UProductAttribute_TA*>                Attributes;                                       		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ClientLoadoutOnlineData
// 0x0010
struct FClientLoadoutOnlineData
{
	TArray<struct FClientLoadoutOnlineProduct>         Products;                                         		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.InputRate
// 0x0008
struct FInputRate
{
	float                                              RiseRate;                                         		// 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FallRate;                                         		// 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.TurningCircle
// 0x0010
struct FTurningCircle
{
	struct FVector                                     Center;                                           		// 0x0000 (0x000C) [0x0000000000000000]               
	float                                              Radius;                                           		// 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.StatValue
// 0x0014
struct FStatValue
{
	struct FName                                       Id;                                               		// 0x0000 (0x0008) [0x0000000000000000]               
	int                                                Values[0x3];                                      		// 0x0008 (0x000C) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.GFxTeamColor
// 0x0010
struct FGFxTeamColor
{
	struct FColor                                      Value;                                            		// 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int                                                ColorID;                                          		// 0x0004 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int                                                X;                                                		// 0x0008 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int                                                Y;                                                		// 0x000C (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.MapGroup
// 0x0010
struct FMapGroup
{
	TArray<class UMapData_TA*>                         Maps;                                             		// 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.MapImageLoadResult
// 0x0010
struct FMapImageLoadResult
{
	class UTexture2D*                                  Image;                                            		// 0x0000 (0x0008) [0x0000000000000000]               
	struct FName                                       MapName;                                          		// 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ProductThumbnailResult
// 0x0018
struct FProductThumbnailResult
{
	class UProductAsset_TA*                            Asset;                                            		// 0x0000 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                    		// 0x0008 (0x0008) [0x0000000000000000]               
	class UProductThumbnail_TA*                        Thumbnail;                                        		// 0x0010 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.RandomWeight
// 0x0010
struct FRandomWeight
{
	class UObject*                                     Obj;                                              		// 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Weight;                                           		// 0x0008 (0x0004) [0x0000000000000000]               
	float                                              OrigWeight;                                       		// 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.WeldingInfo
// 0x0024
struct FWeldingInfo
{
	class ARBActor_TA*                                 RBActor;                                          		// 0x0000 (0x0008) [0x0000000000000000]               
	struct FVector                                     Offset;                                           		// 0x0008 (0x000C) [0x0000000000000000]               
	float                                              Mass;                                             		// 0x0014 (0x0004) [0x0000000000000000]               
	struct FRotator                                    Rotation;                                         		// 0x0018 (0x000C) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ProductWithSettings
// 0x0018
struct FProductWithSettings
{
	class UProductAsset_TA*                            Product;                                          		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UProductPaint_TA*                            Paint;                                            		// 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UDataAsset_ESportsTeam_TA*                   ESportsTeam;                                      		// 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.VehicleInputs
// 0x0020
struct FVehicleInputs
{
	float                                              Throttle;                                         		// 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Steer;                                            		// 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Pitch;                                            		// 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Yaw;                                              		// 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Roll;                                             		// 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DodgeForward;                                     		// 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DodgeRight;                                       		// 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	unsigned long                                      bHandbrake : 1;                                   		// 0x001C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	unsigned long                                      bJump : 1;                                        		// 0x001C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	unsigned long                                      bActivateBoost : 1;                               		// 0x001C (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	unsigned long                                      bHoldingBoost : 1;                                		// 0x001C (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	unsigned long                                      bJumped : 1;                                      		// 0x001C (0x0004) [0x0000000000000000] [0x00000010] 
};

// ScriptStruct TAGame._Types_TA.ProductAttributesArray
// 0x0010
struct FProductAttributesArray
{
	TArray<class UProductAttribute_TA*>                Attributes;                                       		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadoutAttributesArray
// 0x0010
struct FLoadoutAttributesArray
{
	TArray<struct FProductAttributesArray>             Products;                                         		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ProductTradeInFilter
// 0x0040
struct FProductTradeInFilter
{
	int                                                Id;                                               		// 0x0000 (0x0004) [0x0000000000000000]               
	struct FString                                     Label;                                            		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<int>                                        SeriesIDs;                                        		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long                                      bBlueprint : 1;                                   		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	TArray<unsigned char>                              TradeInQualities;                                 		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ColorOverride
// 0x0014
struct FColorOverride
{
	unsigned long                                      bOverride : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FLinearColor                                Color;                                            		// 0x0004 (0x0010) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.TeamColor
// 0x0020
struct FTeamColor
{
	struct FLinearColor                                FontColor;                                        		// 0x0000 (0x0010) [0x0000000000000000]               
	TArray<struct FLinearColor>                        Colors;                                           		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.MapSkillSettings
// 0x000C
struct FMapSkillSettings
{
	struct FName                                       MapName;                                          		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              MinimumSkill;                                     		// 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialTextureParam
// 0x0010
struct FMaterialTextureParam
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UTexture*                                    Value;                                            		// 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialVectorParam
// 0x0018
struct FMaterialVectorParam
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FLinearColor                                Value;                                            		// 0x0008 (0x0010) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialScalarParam
// 0x000C
struct FMaterialScalarParam
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.MaterialParams
// 0x0030
struct FMaterialParams
{
	TArray<struct FMaterialTextureParam>               TextureParameters;                                		// 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FMaterialVectorParam>                VectorParameters;                                 		// 0x0010 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FMaterialScalarParam>                ScalarParameters;                                 		// 0x0020 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.AssociativeMaterialParams
// 0x0038
struct FAssociativeMaterialParams
{
	class UMaterialInterface*                          Material;                                         		// 0x0000 (0x0008) [0x0000000000020001] (CPF_Edit | CPF_EditConst)
	struct FMaterialParams                             Params;                                           		// 0x0008 (0x0030) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.SkinBodySettings
// 0x0048
struct FSkinBodySettings
{
	class UProductAssetReferenceBody_TA*               Body;                                             		// 0x0000 (0x0008) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
	struct FMaterialParams                             Parameters;                                       		// 0x0008 (0x0030) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<struct FAssociativeMaterialParams>          AdditionalBodyParameters;                         		// 0x0038 (0x0010) [0x0000000000400041] (CPF_Edit | CPF_EditConstArray | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ProductSkinOverride
// 0x0010
struct FProductSkinOverride
{
	struct FName                                       SkinName;                                         		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UMaterialInterface*                          Material;                                         		// 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.OnlineProductAttribute
// 0x0018
struct FOnlineProductAttribute
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000000]               
	struct FString                                     Value;                                            		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.OnlineProductData
// 0x0038
struct FOnlineProductData
{
	int                                                ProductID;                                        		// 0x0000 (0x0004) [0x0000000000000000]               
	unsigned long long                                 InstanceID;                                       		// 0x0008 (0x0008) [0x0000000000000000]               
	int                                                SeriesID;                                         		// 0x0010 (0x0004) [0x0000000000000000]               
	TArray<struct FOnlineProductAttribute>             Attributes;                                       		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                TradeHold;                                        		// 0x0028 (0x0004) [0x0000000000000000]               
	unsigned long long                                 AddedTimestamp;                                   		// 0x0030 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.CurrencyProductData
// 0x0010
struct U_Types_TA_FCurrencyProductData
{
	class UProduct_TA*                                 Product;                                          		// 0x0000 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                    		// 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.Currency
// 0x0060
struct FCurrency
{
	unsigned char                                      Type;                                             		// 0x0000 (0x0001) [0x0000000000000000]               
	struct FName                                       Name;                                             		// 0x0004 (0x0008) [0x0000000000000000]               
	unsigned long                                      bCanBeTraded : 1;                                 		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                TradeHold;                                        		// 0x0010 (0x0004) [0x0000000000000000]               
	struct U_Types_TA_FCurrencyProductData             ProductData;                                      		// 0x0018 (0x0010) [0x0000000000000000]               
	int                                                CurrencyID;                                       		// 0x0028 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int                                                Id;                                               		// 0x002C (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int                                                Amount;                                           		// 0x0030 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	class UTexture*                                    LargeImage;                                       		// 0x0038 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	class UTexture*                                    SmallImage;                                       		// 0x0040 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FString                                     LocalizedName;                                    		// 0x0048 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	unsigned long long                                 UpdatedTimestamp;                                 		// 0x0058 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.OnlineXPModifier
// 0x0034
struct FOnlineXPModifier
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	float                                              Modifier;                                         		// 0x0008 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	unsigned char                                      ModifierType;                                     		// 0x000C (0x0001) [0x0000000040000000] (CPF_EditInlineNotify)
	int                                                Value;                                            		// 0x0010 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	struct FString                                     LocalizedText;                                    		// 0x0018 (0x0010) [0x0000000040400000] (CPF_NeedCtorLink | CPF_EditInlineNotify)
	unsigned long                                      bPremium : 1;                                     		// 0x0028 (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
	unsigned long                                      bPenalty : 1;                                     		// 0x0028 (0x0004) [0x0000000040000000] [0x00000002] (CPF_EditInlineNotify)
	int                                                Count;                                            		// 0x002C (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int                                                MaxCount;                                         		// 0x0030 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.OnlineXPReward
// 0x0040
struct FOnlineXPReward
{
	struct FName                                       RewardName;                                       		// 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Total;                                            		// 0x0008 (0x0004) [0x0000000000000000]               
	int                                                Base;                                             		// 0x000C (0x0004) [0x0000000000000000]               
	int                                                BaseLevel;                                        		// 0x0010 (0x0004) [0x0000000000000000]               
	int                                                Level;                                            		// 0x0014 (0x0004) [0x0000000000000000]               
	int                                                CapAdjustment;                                    		// 0x0018 (0x0004) [0x0000000000000000]               
	TArray<int>                                        LevelThresholds;                                  		// 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FOnlineXPModifier>                   RewardModifiers;                                  		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.OnlineProductDrop
// 0x0078
struct FOnlineProductDrop
{
	struct FUniqueNetId                                PlayerID;                                         		// 0x0000 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FOnlineProductData>                  ProductData;                                      		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FCurrency>                           CurrencyData;                                     		// 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FOnlineXPReward>                     RewardDrops;                                      		// 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ChallengeRequirementProgress
// 0x0008
struct FChallengeRequirementProgress
{
	int                                                ProgressCount;                                    		// 0x0000 (0x0004) [0x0000000000000000]               
	int                                                ProgressChange;                                   		// 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.ChallengeProgress
// 0x0028
struct FChallengeProgress
{
	int                                                Id;                                               		// 0x0000 (0x0004) [0x0000000000000000]               
	unsigned long                                      bIsHidden : 1;                                    		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                CompleteCount;                                    		// 0x0008 (0x0004) [0x0000000000000000]               
	unsigned long                                      bNotifyCompleted : 1;                             		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bNotifyAvailable : 1;                             		// 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bNotifyNewInfo : 1;                               		// 0x000C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bRewardsAvailable : 1;                            		// 0x000C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bComplete : 1;                                    		// 0x000C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long long                                 ProgressResetTimeUTC;                             		// 0x0010 (0x0008) [0x0000000000000000]               
	TArray<struct FChallengeRequirementProgress>       RequirementProgress;                              		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.XPRewardData
// 0x000C
struct FXPRewardData
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	float                                              Amount;                                           		// 0x0008 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.GarageSlotCost
// 0x0008
struct FGarageSlotCost
{
	int                                                Id;                                               		// 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	int                                                Amount;                                           		// 0x0004 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.ProductDrop
// 0x001C
struct FProductDrop
{
	struct FProductHashID                              GroupId;                                          		// 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	unsigned long long                                 DropID;                                           		// 0x0008 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	unsigned long long                                 DropTime;                                         		// 0x0010 (0x0008) [0x0000000040000000] (CPF_EditInlineNotify)
	unsigned long                                      bCanEquipNow : 1;                                 		// 0x0018 (0x0004) [0x0000000040000000] [0x00000001] (CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.RPCIntroCar
// 0x0038
struct FRPCIntroCar
{
	int                                                TemplateIndex;                                    		// 0x0000 (0x0004) [0x0000000000000000]               
	struct FString                                     TemplateName;                                     		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FString                                     TemplateDescription;                              		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<int>                                        ProductsList;                                     		// 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.IntroCarInfo
// 0x0028
struct FIntroCarInfo
{
	int                                                TemplateIndex;                                    		// 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FString                                     TemplateName;                                     		// 0x0008 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FString                                     TemplateDescription;                              		// 0x0018 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.EditorIntroCar
// 0x0038
struct FEditorIntroCar
{
	struct FIntroCarInfo                               Info;                                             		// 0x0000 (0x0028) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	TArray<class UProduct_TA*>                         ProductList;                                      		// 0x0028 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.GarageComplexRow
// 0x0008
struct FGarageComplexRow
{
	int                                                RowID;                                            		// 0x0000 (0x0004) [0x0000000000000000]               
	int                                                ProductID;                                        		// 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.GarageComplexLoadout
// 0x0020
struct FGarageComplexLoadout
{
	struct FLoadoutTeamPaint                           TeamPaint;                                        		// 0x0000 (0x0010) [0x0000000000000000]               
	TArray<unsigned long long>                         OnlineProducts;                                   		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.GarageComplexSlot
// 0x0070
struct FGarageComplexSlot
{
	int                                                SlotID;                                           		// 0x0000 (0x0004) [0x0000000000000000]               
	struct FString                                     Name;                                             		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long                                      bUnlocked : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                TeamIndex;                                        		// 0x001C (0x0004) [0x0000000000000000]               
	struct FRotator                                    Rotation;                                         		// 0x0020 (0x000C) [0x0000000000000000]               
	struct FGarageComplexLoadout                       SlotLoadouts[0x2];                                		// 0x0030 (0x0040) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.AppliedBreakoutDamage
// 0x0018
struct FAppliedBreakoutDamage
{
	unsigned char                                      Id;                                               		// 0x0000 (0x0001) [0x0000000000000000]               
	struct FVector                                     Location;                                         		// 0x0004 (0x000C) [0x0000000000000000]               
	int                                                DamageIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]               
	int                                                TotalDamage;                                      		// 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.PaintAttributeParameter
// 0x0010
struct FPaintAttributeParameter
{
	unsigned char                                      PaintVariant;                                     		// 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       ParameterName;                                    		// 0x0004 (0x0008) [0x0000000000000001] (CPF_Edit)    
	unsigned long                                      bEnabled : 1;                                     		// 0x000C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	unsigned long                                      bGammaCorrect : 1;                                		// 0x000C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
};

// ScriptStruct TAGame._Types_TA.ProductLevelData
// 0x0010
struct FProductLevelData
{
	int                                                Level;                                            		// 0x0000 (0x0004) [0x0000000040000001] (CPF_Edit | CPF_EditInlineNotify)
	int                                                SoftCurrency;                                     		// 0x0004 (0x0004) [0x0000000040000001] (CPF_Edit | CPF_EditInlineNotify)
	int                                                HardCurrency;                                     		// 0x0008 (0x0004) [0x0000000040000001] (CPF_Edit | CPF_EditInlineNotify)
	float                                              UnlockWeight;                                     		// 0x000C (0x0004) [0x0000000040000001] (CPF_Edit | CPF_EditInlineNotify)
};

// ScriptStruct TAGame._Types_TA.BallPredictionInfo
// 0x003C
struct FBallPredictionInfo
{
	float                                              Time;                                             		// 0x0000 (0x0004) [0x0000000000000000]               
	float                                              ArchTopTime;                                      		// 0x0004 (0x0004) [0x0000000000000000]               
	struct FVector                                     Location;                                         		// 0x0008 (0x000C) [0x0000000000000000]               
	struct FVector                                     Velocity;                                         		// 0x0014 (0x000C) [0x0000000000000000]               
	struct FVector                                     ArchTop;                                          		// 0x0020 (0x000C) [0x0000000000000000]               
	struct FVector                                     ArchTopVelocity;                                  		// 0x002C (0x000C) [0x0000000000000000]               
	unsigned long                                      bHitWall : 1;                                     		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHitGround : 1;                                   		// 0x0038 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct TAGame._Types_TA.AimAssistSettings
// 0x0034
struct FAimAssistSettings
{
	unsigned long                                      bOverride : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ControlAlpha;                                     		// 0x0004 (0x0004) [0x0000000000000000]               
	float                                              MinSteerDot;                                      		// 0x0008 (0x0004) [0x0000000000000000]               
	float                                              MaxSteerDot;                                      		// 0x000C (0x0004) [0x0000000000000000]               
	float                                              MinVelocity;                                      		// 0x0010 (0x0004) [0x0000000000000000]               
	float                                              MaxVelocity;                                      		// 0x0014 (0x0004) [0x0000000000000000]               
	float                                              MinPlayerInputDrive;                              		// 0x0018 (0x0004) [0x0000000000000000]               
	float                                              MinDistanceToBallXY;                              		// 0x001C (0x0004) [0x0000000000000000]               
	float                                              MaxDistanceToBallXY;                              		// 0x0020 (0x0004) [0x0000000000000000]               
	float                                              MinDistanceToBallZ;                               		// 0x0024 (0x0004) [0x0000000000000000]               
	float                                              MaxDistanceToBallZ;                               		// 0x0028 (0x0004) [0x0000000000000000]               
	float                                              MinDotAngleFromBall;                              		// 0x002C (0x0004) [0x0000000000000000]               
	float                                              MaxDotAngleFromBall;                              		// 0x0030 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.StatData
// 0x000C
struct FStatData
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000000]               
	int                                                Count;                                            		// 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.QuickChatGroup
// 0x0014
struct FQuickChatGroup
{
	struct FString                                     Key;                                              		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int                                                Count;                                            		// 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.OnlinePlayerMatchData
// 0x0110
struct FOnlinePlayerMatchData
{
	class APRI_TA*                                     PRI;                                              		// 0x0000 (0x0008) [0x0000000000002000] (CPF_Transient)
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              GameSecondsPlayed;                                		// 0x0050 (0x0004) [0x0000000000000000]               
	int                                                GameScore;                                        		// 0x0054 (0x0004) [0x0000000000000000]               
	int                                                MatchGoals;                                       		// 0x0058 (0x0004) [0x0000000000000000]               
	int                                                MatchAssists;                                     		// 0x005C (0x0004) [0x0000000000000000]               
	int                                                MatchSaves;                                       		// 0x0060 (0x0004) [0x0000000000000000]               
	int                                                MatchShots;                                       		// 0x0064 (0x0004) [0x0000000000000000]               
	int                                                XPGained;                                         		// 0x0068 (0x0004) [0x0000000000000000]               
	TArray<struct FOnlineProductData>                  Loadout;                                          		// 0x0070 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	unsigned long                                      bCompletedMatch : 1;                              		// 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bForfeit : 1;                                     		// 0x0080 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bMvp : 1;                                         		// 0x0080 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bWinner : 1;                                      		// 0x0080 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bLeaver : 1;                                      		// 0x0080 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bInParty : 1;                                     		// 0x0080 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bJoinedInProgress : 1;                            		// 0x0080 (0x0004) [0x0000000000000000] [0x00000040] 
	int                                                ConsecutiveMatchesPlayed;                         		// 0x0084 (0x0004) [0x0000000000000000]               
	struct FUniqueNetId                                PartyLeader;                                      		// 0x0088 (0x0048) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              DistanceDrivenKM;                                 		// 0x00D0 (0x0004) [0x0000000000000000]               
	unsigned long                                      bPartyLeaderValid : 1;                            		// 0x00D4 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                TeamIndex;                                        		// 0x00D8 (0x0004) [0x0000000000000000]               
	TArray<struct FStatData>                           Stats;                                            		// 0x00E0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FLoadoutData>                        TeamLoadouts;                                     		// 0x00F0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	TArray<struct FQuickChatGroup>                     QuickChat;                                        		// 0x0100 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ActorHistory
// 0x0020
struct FActorHistory
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000000]               
	unsigned char                                      Type;                                             		// 0x0008 (0x0001) [0x0000000000000000]               
	struct FString                                     SerializedHistory;                                		// 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.SortedProductData
// 0x002C
struct FSortedProductData
{
	unsigned long long                                 Id;                                               		// 0x0000 (0x0008) [0x0000000000000000]               
	struct FProductHashID                              HashID;                                           		// 0x0008 (0x0004) [0x0000000000000000]               
	class UProduct_TA*                                 Product;                                          		// 0x0010 (0x0008) [0x0000000000000000]               
	class UOnlineProduct_TA*                           OnlineProduct;                                    		// 0x0018 (0x0008) [0x0000000000000000]               
	int                                                BlueprintSortWeight;                              		// 0x0020 (0x0004) [0x0000000000000000]               
	int                                                Quantity;                                         		// 0x0024 (0x0004) [0x0000000000000000]               
	unsigned long                                      bUnlocked : 1;                                    		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIsFavorited : 1;                                 		// 0x0028 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bCurrency : 1;                                    		// 0x0028 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct TAGame._Types_TA.EditorRoundData
// 0x0018
struct FEditorRoundData
{
	float                                              TimeLimit;                                        		// 0x0000 (0x0004) [0x0000000040000000] (CPF_EditInlineNotify)
	TArray<struct FString>                             SerializedArchetypes;                             		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadObjectResult
// 0x0021
struct FLoadObjectResult
{
	struct FString                                     FilePath;                                         		// 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UObject*                                     ObjectData;                                       		// 0x0010 (0x0008) [0x0000000000000000]               
	class UError*                                      Error;                                            		// 0x0018 (0x0008) [0x0000000000000000]               
	unsigned char                                      Code;                                             		// 0x0020 (0x0001) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.SaveObjectResult
// 0x0011
struct FSaveObjectResult
{
	class UObject*                                     ObjectData;                                       		// 0x0000 (0x0008) [0x0000000000000000]               
	class UError*                                      Error;                                            		// 0x0008 (0x0008) [0x0000000000000000]               
	unsigned char                                      Code;                                             		// 0x0010 (0x0001) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.UniqueNetIdGroup4
// 0x0120
struct FUniqueNetIdGroup4
{
	struct FUniqueNetId                                PlayerIDs[0x4];                                   		// 0x0000 (0x0120) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ChatBanInfo
// 0x000C
struct FChatBanInfo
{
	unsigned long long                                 Expiration;                                       		// 0x0000 (0x0008) [0x0000000000000000]               
	unsigned long                                      bPermanentlyBanned : 1;                           		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct TAGame._Types_TA.SimilarLogoGroup
// 0x0010
struct FSimilarLogoGroup
{
	TArray<class UProductAsset_Logo_TA*>               SimilarLogoColorAssets;                           		// 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.UIProductSlotData
// 0x0018
struct FUIProductSlotData
{
	class UProductSlot_TA*                             Slot;                                             		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UTexture2D*                                  Texture;                                          		// 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UAkSoundCue*                                 Sound;                                            		// 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.SimpleSpringSettings
// 0x0050
struct FSimpleSpringSettings
{
	struct FVector                                     Strength;                                         		// 0x0000 (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     Damping;                                          		// 0x000C (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     MaxDisplacement;                                  		// 0x0018 (0x000C) [0x0000000000000001] (CPF_Edit)    
	unsigned long                                      bUseMinDisplacement : 1;                          		// 0x0024 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	struct FVector                                     MinDisplacement;                                  		// 0x0028 (0x000C) [0x0000000000000001] (CPF_Edit)    
	float                                              Mass;                                             		// 0x0034 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     MassOffset;                                       		// 0x0038 (0x000C) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxSpeed;                                         		// 0x0044 (0x0004) [0x0000000000000001] (CPF_Edit)    
	unsigned long                                      bDebug : 1;                                       		// 0x0048 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	float                                              DrawDebugOffset;                                  		// 0x004C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.WheelContactData
// 0x0050
struct FWheelContactData
{
	unsigned long                                      bHasContact : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHasContactWithWorldGeometry : 1;                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              HasContactChangeTime;                             		// 0x0004 (0x0004) [0x0000000000000000]               
	class AActor*                                      Actor;                                            		// 0x0008 (0x0008) [0x0000000000000000]               
	class UPrimitiveComponent*                         Component;                                        		// 0x0010 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	struct FVector                                     Location;                                         		// 0x0018 (0x000C) [0x0000000000000000]               
	struct FVector                                     Normal;                                           		// 0x0024 (0x000C) [0x0000000000000000]               
	struct FVector                                     LatDirection;                                     		// 0x0030 (0x000C) [0x0000000000000000]               
	struct FVector                                     LongDirection;                                    		// 0x003C (0x000C) [0x0000000000000000]               
	class UPhysicalMaterialProperty_TA*                PhysMatProp;                                      		// 0x0048 (0x0008) [0x0000000000000000]               
};

// ScriptStruct TAGame._Types_TA.WheelAttachment
// 0x0030
struct FWheelAttachment
{
	class UPrimitiveComponent*                         Component;                                        		// 0x0000 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	TArray<class UAttachmentBehavior_TA*>              Behaviors;                                        		// 0x0008 (0x0010) [0x0000000004400001] (CPF_Edit | CPF_NeedCtorLink | CPF_EditInline)
	struct FName                                       Socket;                                           		// 0x0018 (0x0008) [0x0000000000000001] (CPF_Edit)    
	TArray<class UMaterialInterface*>                  PaintableMaterials;                               		// 0x0020 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ProductAttachment
// 0x0070
struct FProductAttachment
{
	class UStaticMesh*                                 StaticMesh;                                       		// 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class USkeletalMesh*                               SkeletalMesh;                                     		// 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UParticleSystem*                             ParticleSystem;                                   		// 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UMaterialInterface*                          Material;                                         		// 0x0018 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              Scale;                                            		// 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     Translation;                                      		// 0x0024 (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FRotator                                    Rotation;                                         		// 0x0030 (0x000C) [0x0000000000000001] (CPF_Edit)    
	unsigned char                                      Socket;                                           		// 0x003C (0x0001) [0x0000000000000001] (CPF_Edit)    
	class UAntennaComponent_TA*                        Antenna;                                          		// 0x0040 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	TArray<class UAttachmentBehavior_TA*>              Behaviors;                                        		// 0x0048 (0x0010) [0x0000000004400001] (CPF_Edit | CPF_NeedCtorLink | CPF_EditInline)
	class UProductAttribute_InheritCarSetting_TA*      InheritCarAttribute;                              		// 0x0058 (0x0008) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
	class UPrimitiveComponent*                         Component;                                        		// 0x0060 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	class AFXActor_X*                                  FXActor;                                          		// 0x0068 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct TAGame._Types_TA.AccumulatedRigidBodyCollision
// 0x0080
struct FAccumulatedRigidBodyCollision
{
	class AActor*                                      Actor;                                            		// 0x0000 (0x0008) [0x0000000000000000]               
